一、程式設計規約 
(一) 命名風格
1. 【強制】代碼中的命名均不能以底線或美元符號開始，也不能以底線或美元符號結束。 
2. 【強制】所有程式設計相關的命名嚴禁使用拼音與英文混合的方式，更不允許直接使用中文的方式。
3. 【強制】類名使用 UpperCamelCase 風格，但以下情形例外:DO / BO / DTO / VO / AO /PO / UID 等。
4. 【強制】方法名、參數名、成員變數、區域變數都統一使用 lowerCamelCase 風格。正例:localValue / getHttpMessage() / inputUserId
5. 【強制】常量命名全部大寫，單詞間用底線隔開，力求語義表達完整清楚，不要嫌名字長。
6. 【強制】抽象類別命名使用 Abstract 或 Base 開頭;異常類命名使用 Exception 結尾;測試類命名以它要測試的類的名稱開始，以 Test 結尾。
7. 【強制】類型與中括弧緊挨相連來表示陣列。
8. 【強制】POJO 類中的任何布林類型的變數，都不要加 is 首碼，否則部分框架解析會引起序列化錯誤。
9. 【強制】包名統一使用小寫(，)點分隔符號之間有且僅有一個自然語義的英語單詞。包名統一使用單數形式，但是類名如果有複數含義，類名可以使用複數形式。
10.【強制】避免在子父類的成員變數之間、或者不同代碼塊的區域變數之間採用完全相同的命名，使可讀性降低。
11.【強制】杜絕完全不規範的縮寫，避免望文不知義。
12.【推薦】為了達到代碼自解釋的目標，任何自訂程式設計元素在命名時，使用儘量完整的單詞組合來表達。
13.【推薦】在常量與變數的命名時，表示類型的名詞放在詞尾，以提升辨識度。 
14.【推薦】如果模組、介面、類、方法使用了設計模式，在命名時需體現出具體模式。
15.【推薦】介面類別中的方法和屬性不要加任何修飾符號(public 也不要加)，保持代碼的 簡潔性，並加上有效的 Javadoc 注釋。儘量不要在介面裡定義變數，如果一定要定義變數， 確定與介面方法相關，並且是整個應用的基礎常量。
16. 介面和實現類的命名有兩套規則:
1)【強制】對於 Service 和 DAO 類，基於 SOA 的理念，暴露出來的服務一定是介面，內部的實現類 用 Impl 的尾碼與介面區別。
2)【推薦】如果是形容能力的介面名稱，取對應的形容詞為介面名(通常是–able 的形容詞)。
17.【參考】枚舉類名帶上 Enum 尾碼，枚舉成員名稱需要全大寫，單詞間用底線隔開。
18.【參考】各層命名規約:
A) Service/DAO 層方法命名規約
1)獲取單個物件的方法用 get 做首碼。
2)獲取多個物件的方法用 list 做首碼，複數結尾。 
3)獲取統計值的方法用 count 做首碼。
4)插入的方法用 save/insert 做首碼。
5)刪除的方法用 remove/delete 做首碼。
6)修改的方法用 update 做首碼。
B) 領域模型命名規約
1)資料物件:xxxDO，xxx 即為資料表名。 
2)資料傳輸對象:xxxDTO，xxx 為業務領域相關的名稱。
3)展示物件:xxxVO，xxx 一般為網頁名稱。
4) POJO 是 DO/DTO/BO/VO 的統稱，禁止命名成 xxxPOJO。
(二) 常量定義
1. 【強制】不允許任何魔法值(即未經預先定義的常量)直接出現在代碼中。 
2. 【強制】在 long 或者 Long 賦值時，數值後使用大寫的 L，不能是小寫的 l，小寫容易跟數字 混淆，造成誤解。
3. 【推薦】不要使用一個常量類維護所有常量，要按常量功能進行歸類，分開維護。 
4. 【推薦】常量的複用層次有五層:跨應用共用常量、應用內共用常量、子工程內共用常量、包內共用常量、類內共用常量。
1)跨應用共用常量:放置在二方庫中，通常是 client.jar 中的 constant 目錄下。 
2)應用內共用常量:放置在一方庫中，通常是子模組中的 constant 目錄下。 
3)子工程內部共用常量:即在當前子工程的 constant 目錄下。 
4)包內共用常量:即在當前包下單獨的 constant 目錄下。 
5)類內共用常量:直接在類內部 private static final 定義。
5. 【推薦】如果變數值僅在一個固定範圍內變化用 enum 類型來定義。
(三) 代碼格式
1. 【強制】如果是大括弧內為空，則簡潔地寫成{}即可，大括弧中間無需換行和空格;如果是非 空代碼塊則:
1)左大括弧前不換行。
2)左大括弧後換行。
3)右大括弧前換行。
4)右大括弧後還有 else 等代碼則不換行;表示終止的右大括弧後必須換行。
2. 【強制】左小括弧和右邊相鄰字元之間不出現空格;右小括弧和左邊相鄰字元之間也不出現空格;而左大括弧前需要加空格。詳見第 5 條下方正例提示。
3. 【強制】if/for/while/switch/do 等保留字與括弧之間都必須加空格。
4. 【強制】任何二目、三目運算子的左右兩邊都需要加一個空格。
5. 【強制】採用 4 個空格縮進，禁止使用 tab 字元。
6. 【強制】注釋的雙斜線與注釋內容之間有且僅有一個空格。
7. 【強制】在進行類型強制轉換時，右括弧與強制轉換值之間不需要任何空格隔開。
8. 【強制】單行字元數限制不超過 120 個，超出需要換行，換行時遵循如下原則: 
1)第二行相對第一行縮進 4 個空格，從第三行開始，不再繼續縮進，參考示例。 
2)運算子與下文一起換行。
3)方法調用的點符號與下文一起換行。 
4)方法調用中的多個參數需要換行時，在逗號後進行。
5)在括弧前不要換行，見反例。 
9. 【強制】方法參數在定義和傳入時，多個參數逗號後邊必須加空格。 正例:下例中實參的 args1，後邊必須要有一個空格。method(args1, args2, args3);
10.【強制】IDE 的 text file encoding 設置為 UTF-8; IDE 中檔的分行符號使用 Unix 格式，不 要使用 Windows 格式。Web 網頁的編碼也一律使用 UTF-8。
11. 【推薦】單個方法的總行數不超過 80 行。 說明:除注釋之外的方法簽名、左右大括弧、方法內代碼、空行、回車及任何不可見字元的總行數不超過 80 行。
12. 【推薦】沒有必要增加若干空格來使變數的賦值等號與上一行對應位置的等號對齊。 
13. 【推薦】不同邏輯、不同語義、不同業務的代碼之間插入一個空行分隔開來以提升可讀性。 (代碼區塊用空白行隔開)
(四) OOP 規約
1. 【強制】避免通過一個類的物件引用訪問此類的靜態變數或靜態方法，無謂增加編譯器解析 成本，直接用類名來訪問即可。
2. 【強制】所有的覆寫方法，必須加@Override 注解。
3. 【強制】相同參數類型，相同業務含義，才可以使用 Java 的可變參數，避免使用 Object。 說明:可變參數必須放置在參數列表的最後。(提倡同學們儘量不用可變參數程式設計) 
4. 【強制】外部正在調用或者二方庫依賴的介面，不允許修改方法簽名，避免對介面調用方產生影 響。介面過時必須加@Deprecated 注解，並清晰地說明採用的新介面或者新服務是什麼。
5. 【強制】不能使用過時的類或方法。說明:java.net.URLDecoder 中的方法 decode(String encodeStr)這個方法已經過時，應該使用雙參數 decode(String source, String encode)。介面提供方既然明確是過時介面，那麼有義務同時提供新的介面; 作為調用方來說，有義務去考證過時方法的新實現是什麼。
6. 【強制】Object 的 equals 方法容易拋空指針異常，應使用常量或確定有值的物件來調用 equals。
7. 【強制】所有整型包裝類物件之間值的比較，全部使用 equals 方法比較。
8. 【強制】任何貨幣金額，均以最小貨幣單位且整型類型來進行存儲。
9. 【強制】浮點數之間的等值判斷，基底資料型別不能用==來比較，包裝資料類型不能用 equals 來判斷。
10. 【強制】定義資料物件 DO 類時，屬性類型要與資料庫欄位類型相匹配。
11. 【強制】禁止使用構造方法 BigDecimal(double)的方式把 double 值轉化為 BigDecimal 物件。
12. 關於基底資料型別與包裝資料類型的使用標準如下: 1)【強制】所有的 POJO 類屬性必須使用包裝資料類型。 2)【強制】RPC 方法的返回值和參數必須使用包裝資料類型。 3)【推薦】所有的區域變數使用基底資料型別。
13. 【強制】定義 DO/DTO/VO 等 POJO 類時，不要設定任何屬性預設值。
14. 【強制】序列化類新增屬性時，請不要修改 serialVersionUID 欄位，避免反序列失敗;如 果完全不相容升級，避免反序列化混亂，那麼請修改 serialVersionUID 值。
15. 【強制】構造方法裡面禁止加入任何業務邏輯，如果有初始化邏輯，請放在 init 方法中。
16. 【強制】POJO 類必須寫 toString 方法。使用 IDE 中的工具:source> generate toString 時，如果繼承了另一個 POJO 類，注意在前面加一下 super.toString。
17. 【強制】禁止在 POJO 類中，同時存在對應屬性 xxx 的 isXxx()和 getXxx()方法。Boolean 值使用 isXxx()非布林值使用 getXxx()。
18. 【推薦】使用索引訪問用 String 的 split 方法得到的陣列時，需做最後一個分隔符號後有無內容的檢查，否則會有拋 IndexOutOfBoundsException 的風險。
19. 【推薦】當一個類有多個構造方法，或者多個同名方法，這些方法應該按順序放置在一起， 便於閱讀，此條規則優先於下一條。
20. 【推薦】類內方法定義的順序依次是:公有方法或保護方法>私有方法> getter / setter 方 法。
21. 【推薦】setter 方法中，參數名稱與類成員變數名稱一致，this.成員名=參數名。在
22. 【推薦】循環體內，字串的連接方式，使用 StringBuilder 的 append 方法進行擴展。
23. 【推薦】final 可以聲明類、成員變數、方法、以及本地變數，下列情況使用 final 關鍵字: 
1)不允許被繼承的類，如:String 類。
2)不允許修改引用的域對象，如:POJO 類的域變數。
3)不允許被覆寫的方法，如:POJO 類的 setter 方法。
4)不允許運行過程中重新賦值的區域變數。
5)避免上下文重複使用一個變數，使用 final 可以強制重新定義一個變數，方便更好地進行重構。
24. 【推薦】慎用 Object 的 clone 方法來拷貝物件。
25. 【推薦】類成員與方法存取控制從嚴:
1)如果不允許外部直接通過 new 來創建物件，那麼構造方法必須是 private。 
2)工具類不允許有 public 或 default 構造方法。
3)類非 static 成員變數並且與子類共用，必須是 protected。
4)類非 static 成員變數並且僅在本類使用，必須是 private。
5)類 static 成員變數如果僅在本類使用，必須是 private。
6)若是 static 成員變數，考慮是否為 final。
7)類成員方法只供類內部調用，必須是 private。 
8)類成員方法只對繼承類公開，那麼限制為 protected。

(五) 日期時間
1. 【強制】日期格式化時，傳入 pattern 中表示年份統一使用小寫的 y。
2. 【強制】在日期格式中分清楚大寫的 M 和小寫的 m，大寫的 H 和小寫的 h 分別指代的意義。 
3. 【強制】獲取當前毫秒數:System.currentTimeMillis();而不是 new Date().getTime()。
4. 【強制】不允許在程式任何地方中使用:1)java.sql.Date 2)java.sql.Time 3) java.sql.Timestamp。
5. 【強制】不要在程式中寫死一年為 365 天，避免在西曆閏年時出現日期轉換錯誤或程式邏 輯錯誤。
6. 【推薦】避免西曆閏年 2 月問題。閏年的 2 月份有 29 天，一年後的那一天不可能是 2 月 29 日。
7. 【推薦】使用枚舉值來指代月份。如果使用數字，注意 Date，Calendar 等日期相關類的月份 month 取值在 0-11 之間。

(六) 集合處理
1. 【強制】關於 hashCode 和 equals 的處理，遵循如下規則: 
1)只要重寫 equals，就必須重寫 hashCode。
2)因為 Set 存儲的是不重複的物件，依據 hashCode 和 equals 進行判斷，所以 Set 存儲的物件必須重 寫這兩個方法。
3)如果自訂物件作為 Map 的鍵，那麼必須覆寫 hashCode 和 equals。
2. 【強制】判斷所有集合內部的元素是否為空，使用 isEmpty()方法，而不是 size()==0 的方式。
3. 【強制】在使用 java.util.stream.Collectors 類的 toMap()方法轉為 Map 集合時，一定要使用 含有參數類型為 BinaryOperator，參數名為 mergeFunction 的方法，否則當出現相同 key 值時會拋出 IllegalStateException 異常。
4. 【強制】在使用 java.util.stream.Collectors 類的 toMap()方法轉為 Map 集合時，一定要注意當 value 為 null 時會拋 NPE 異常。
5. 【強制】ArrayList 的 subList 結果不可強轉成 ArrayList，否則會拋出 ClassCastException 異常:java.util.RandomAccessSubList cannot be cast to java.util.ArrayList。 
6. 【強制】使用 Map 的方法 keySet()/values()/entrySet()返回集合物件時，不可以對其進行添加元素操作，否則會拋出 UnsupportedOperationException 異常。
7. 【強制】Collections 類返回的對象，如:emptyList()/singletonList()等都是 immutable list， 不可對其進行添加或者刪除元素的操作。
8. 【強制】在 subList 場景中，高度注意對父集合元素的增加或刪除，均會導致子列表的遍歷、 增加、刪除產生 ConcurrentModificationException 異常。
9. 【強制】使用集合轉陣列的方法，必須使用集合的 toArray(T[] array)，傳入的是類型完全一 致、長度為 0 的空陣列。
10. 【強制】在使用 Collection 介面任何實現類的 addAll()方法時，都要對輸入的集合參數進 行 NPE 判斷。
11. 【強制】使用工具類 Arrays.asList()把陣列轉換成集合時，不能使用其修改集合相關的方法， 它的 add/remove/clear 方法會拋出 UnsupportedOperationException 異常。
12. 【強制】泛型萬用字元<? extends T>來接收返回的資料，此寫法的泛型集合不能使用 add 方 法，而<? super T>不能使用 get 方法，兩者在介面調用賦值的場景中容易出錯。
13. 【強制】在無泛型限制定義的集合賦值給泛型限制的集合時，在使用集合元素時，需要進 行 instanceof 判斷，避免拋出 ClassCastException 異常。
14. 【強制】不要在 foreach 迴圈裡進行元素的 remove/add 操作。remove 元素請使用 Iterator 方式，如果併發操作，需要對 Iterator 物件加鎖。
15. 【強制】在 JDK7 版本及以上，Comparator 實現類要滿足如下三個條件，不然 Arrays.sort， Collections.sort 會拋 IllegalArgumentException 異常。
16. 【推薦】集合泛型定義時，在 JDK7 及以上，使用 diamond 語法或全省略。 說明:菱形泛型，即 diamond，直接使用<>來指代前邊已經指定的類型。
17. 【推薦】集合初始化時，指定集合初始值大小。
18. 【推薦】使用 entrySet 遍歷 Map 類集合 KV，而不是 keySet 方式進行遍歷。
19. 【推薦】高度注意 Map 類集合 K/V 能不能存儲 null 值的情況，如下表格: 
20. 【參考】合理利用好集合的有序性(sort)和穩定性(order)，避免集合的無序性(unsort)和不 穩定性(unorder)帶來的負面影響。
21. 【參考】利用 Set 元素唯一的特性，可以快速對一個集合進行去重操作，避免使用 List 的 contains()進行遍歷去重或者判斷包含操作。

 (七) 併發處理
1. 【強制】獲取單例物件需要保證執行緒安全，其中的方法也要保證執行緒安全。
2. 【強制】創建執行緒或執行緒池時請指定有意義的執行緒名稱，方便出錯時回溯。
3. 【強制】執行緒資源必須通過執行緒池提供，不允許在應用中自行顯式創建執行緒。
4. 【強制】執行緒池不允許使用 Executors 去創建，而是通過 ThreadPoolExecutor 的方式， 這樣的處理方式讓寫的同學更加明確執行緒池的運行規則，規避資源耗盡的風險。
5. 【強制】SimpleDateFormat 是執行緒不安全的類，一般不要定義為 static 變數，如果定義為 static，必須加鎖，或者使用 DateUtils 工具類。
6. 【強制】必須回收自訂的 ThreadLocal 變數，尤其在執行緒池場景下，執行緒經常會被覆用， 如果不清理自訂的 ThreadLocal 變數，可能會影響後續業務邏輯和造成記憶體洩露等問題。儘量在代理中使用 try-finally 塊進行回收。
7. 【強制】高併發時，同步調用應該去考量鎖的性能損耗。能用無鎖資料結構，就不要用鎖;能 鎖區塊，就不要鎖整個方法體;能用物件鎖，就不要用類鎖。 
8. 【強制】對多個資源、資料庫表、物件同時加鎖時，需要保持一致的加鎖順序，否則可能會造 成鎖死。
9. 【強制】在使用阻塞等待獲取鎖的方式中，必須在 try 代碼塊之外，並且在加鎖方法與 try 代 碼塊之間沒有任何可能拋出異常的方法調用，避免加鎖成功後，在 finally 中無法解鎖。
10. 【強制】在使用嘗試機制來獲取鎖的方式中，進入業務代碼塊之前，必須先判斷當前執行緒是否 持有鎖。鎖的釋放規則與鎖的阻塞等待方式相同。
11. 【強制】併發修改同一記錄時，避免更新丟失，需要加鎖。要麼在應用層加鎖，要麼在緩存 加鎖，要麼在資料庫層使用樂觀鎖，使用 version 作為更新依據。
12. 【強制】多執行緒並行處理定時任務時，Timer 運行多個 TimeTask 時，只要其中之一沒有捕 獲拋出的異常，其它任務便會自動終止運行，使用 ScheduledExecutorService 則沒有這個問題。
13. 【推薦】資金相關的金融敏感資訊，使用悲觀鎖策略。
14. 【推薦】使用 CountDownLatch 進行非同步轉同步操作，每個執行緒退出前必須調用 countDown 方法，執行緒執行代碼注意 catch 異常，確保 countDown 方法被執行到，避免主 執行緒無法執行至 await 方法，直到超時才返回結果。
15. 【推薦】避免 Random 實例被多執行緒使用，雖然共用該實例是執行緒安全的，但會因競爭同一 seed 導致的性能下降。
16.【推薦】通過雙重檢查鎖(double-checked locking)(在併發場景下)實現延遲初始化的優化 問題隱患(可參考 The"Double-Checked Locking is Broken"Declaration)，推薦解決方案中較為簡 單一種(適用於 JDK5 及以上版本)，將目標屬性聲明為 volatile 型(比如修改 helper 的屬性聲明為`private volatile Helper helper = null;`)。
17.【參考】volatile 解決多執行緒記憶體不可見問題。對於一寫多讀，是可以解決變數同步問題， 但是如果多寫，同樣無法解決執行緒安全問題。
18. 【參考】HashMap 在容量不夠進行 resize 時由於高併發可能出現死鏈，導致 CPU 飆升， 在開發過程中注意規避此風險。
19. 【參考】ThreadLocal 物件使用 static 修飾，ThreadLocal 無法解決共用物件的更新問題。

(八) 控制語句
1. 【強制】在一個 switch 塊內，每個 case 要麼通過 continue/break/return 等來終止，要麼注釋 說明程式將繼續執行到哪一個 case 為止;在一個 switch 塊內，都必須包含一個 default語句並且放在最後，即使它什麼代碼也沒有。
2. 【強制】當 switch 括弧內的變數類型為 String 並且此變數為外部參數時，必須先進行 null 判斷。
3. 【強制】在 if/else/for/while/do 語句中必須使用大括弧。 說明:即使只有一行代碼，禁止不採用大括弧的編碼方式:if (condition) statements;
4. 【強制】三目運算子 condition?運算式 1 :運算式 2 中，高度注意運算式 1 和 2 在類型對齊 時，可能拋出因自動拆箱導致的 NPE 異常。 
5. 【強制】在高併發場景中，避免使用”等於”判斷作為中斷或退出的條件。
6. 【推薦】當某個方法的代碼行數超過 10 行時，return / throw 等中斷邏輯的右大括弧後加一 個空行。
7. 【推薦】表達異常的分支時，少用 if-else 方式，這種方式可以改寫成:
8. 【推薦】除常用方法(如 getXxx/isXxx)等外，不要在條件判斷中執行其它複雜的語句，將複 雜邏輯判斷的結果賦值給一個有意義的布林變數名，以提高可讀性。
9. 【推薦】不要在其它運算式(尤其是條件運算式)中，插入設定陳述式。
10. 【推薦】循環體中的語句要考量性能，以下操作儘量移至循環體外處理，如定義物件、變數、 獲取資料庫連接，進行不必要的 try-catch 操作(這個 try-catch 是否可以移至循環體外)。
11. 【推薦】避免採用取反邏輯運算子。 說明:取反邏輯不利於快速理解，並且取反邏輯寫法必然存在對應的正向邏輯寫法。 
12. 【推薦】介面入參保護，這種場景常見的是用作批量操作的介面。 反例:某業務系統，提供一個使用者批量查詢的介面，API 文檔上有說最多查多少個，但介面實現上沒做任何保護，導致調用方傳了一個 1000 的使用者 id陣列過來後，查詢資訊後，記憶體爆了。
13. 【參考】下列情形，需要進行參數校驗: 
1)調用頻次低的方法。
2)執行時間開銷很大的方法。此情形中，參數校驗時間幾乎可以忽略不計，但如果因為參數錯誤導致 中間執行回退，或者錯誤，那得不償失。
3)需要極高穩定性和可用性的方法。 4)對外提供的開放介面，不管是 RPC/API/HTTP 介面。 5)敏感許可權入口。
14. 【參考】下列情形，不需要進行參數校驗: 
1)極有可能被迴圈調用的方法。但在方法說明裡必須注明外部參數檢查。
2)底層調用頻度比較高的方法。畢竟是像純淨水過濾的最後一道，參數錯誤不太可能到底層才會暴露問 題。一般 DAO 層與 Service 層都在同一個應用中，部署在同一台伺服器中，所以 DAO 的參數校驗，可 以省略。
3)被聲明成 private 只會被自己代碼所調用的方法，如果能夠確定調用方法的代碼傳入參數已經做過檢 查或者肯定不會有問題，此時可以不校驗參數。

 (九) 注釋規約
1. 【強制】類、類屬性、類方法的注釋必須使用 Javadoc 規範，使用/**內容*/格式，不得使用 // xxx 方式。
2. 【強制】所有的抽象方法(包括介面中的方法)必須要用 Javadoc 注釋、除了返回值、參數、 異常說明外，還必須指出該方法做什麼事情，實現什麼功能。 說明:對子類的實現要求，或者調用注意事項，請一併說明。
3. 【強制】所有的類都必須添加創建者和創建日期。
4. 【強制】方法內部單行注釋，在被注釋語句上方另起一行，使用//注釋。方法內部多行注釋 使用/* */注釋，注意與代碼對齊。
5. 【強制】所有的枚舉類型欄位必須要有注釋，說明每個資料項目的用途。
6. 【推薦】與其“半吊子”英文來注釋，不如用中文注釋把問題說清楚。專有名詞與關鍵字保持 英文原文即可。
7. 【推薦】代碼修改的同時，注釋也要進行相應的修改，尤其是參數、返回值、異常、核心邏輯 等的修改。
8. 【推薦】在類中刪除未使用的任何欄位和方法;在方法中刪除未使用的任何參數聲明與內部 變數。
9. 【參考】謹慎注釋掉代碼。在上方詳細說明，而不是簡單地注釋掉。如果無用，則刪除。
10. 【參考】對於注釋的要求:第一、能夠準確反映設計思想和代碼邏輯;第二、能夠描述業務 含義，使別的程式師能夠迅速瞭解到代碼背後的資訊。完全沒有注釋的大段代碼對於閱讀者 形同天書，注釋是給自己看的，即使隔很長時間，也能清晰理解當時的思路;注釋也是給繼 任者看的，使其能夠快速接替自己的工作。
11. 【參考】好的命名、代碼結構是自解釋的，注釋力求精簡準確、表達到位。避免出現注釋的一 個極端:過多過濫的注釋，代碼的邏輯一旦修改，修改注釋是相當大的負擔。
12. 【參考】特殊注釋標記，請注明標記人與標記時間。注意及時處理這些標記，通過標記掃描， 經常清理此類標記。線上故障有時候就是來源於這些標記處的代碼。
1)待辦事宜(TODO):(標記人，標記時間，[預計處理時間]) 表示需要實現，但目前還未實現的功能。這實際上是一個 Javadoc 的標籤，目前的 Javadoc 還沒有實現，但已經被廣泛使用。只能應用於類，介面和方法(因為它是一個 Javadoc 標籤)。 
2)錯誤，不能工作(FIXME):(標記人，標記時間，[預計處理時間])在注釋中用 FIXME 標記某代碼是錯誤的，而且不能工作，需要及時糾正的情況。

(十) 其它
1. 【強制】在使用規則運算式時，利用好其預編譯功能，可以有效加快正則匹配速度。
2. 【強制】避免用 Apache Beanutils 進行屬性的 copy。
3. 【強制】velocity 調用 POJO 類的屬性時，直接使用屬性名取值即可，範本引擎會自動按規範調用 POJO 的 getXxx()，如果是 boolean 基底資料型別變數(boolean 命名不需要加 is 首碼)，會自動調 用 isXxx()方法。
4. 【強制】後臺輸送給頁面的變數必須加$!{var}——中間的感嘆號。
5. 【強制】注意 Math.random()這個方法返回是 double 類型，注意取值的範圍 0≤x<1(能夠取 到零值，注意除零異常)，如果想獲取整數類型的亂數，不要將 x 放大 10 的若干倍然後取 整，直接使用 Random 物件的 nextInt 或者 nextLong 方法。
6. 【推薦】不要在視圖範本中加入任何複雜的邏輯。
7. 【推薦】任何資料結構的構造或初始化，都應指定大小，避免資料結構無限增長吃光記憶體。
8. 【推薦】及時清理不再使用的程式碼片段或配置資訊。 

 二、異常日誌 (一) 錯誤碼

1. 【強制】錯誤碼的制定原則:快速溯源、簡單易記、溝通標準化。 
2. 【強制】錯誤碼不體現版本號和錯誤等級資訊。 
3. 【強制】全部正常，但不得不填充錯誤碼時返回五個零:00000。(表示執行成功)
4. 【強制】錯誤碼為字串類型，共 5 位元，分成兩個部分:錯誤產生來源+四位元數位編號。(四位數使用區間分辨不同類型的錯誤)
5. 【強制】編號不與公司業務架構，更不與組織架構掛鉤，一切與平臺先到先申請的原則進行，審批生效，編號即被永久固定。
6. 【強制】錯誤碼使用者避免隨意定義新的錯誤碼。 
7. 【強制】錯誤碼不能直接輸出給使用者作為提示資訊使用。
8. 【推薦】錯誤碼之外的業務獨特資訊由 error_message 來承載，而不是讓錯誤碼本身涵蓋 過多具體業務屬性。(使用參數可帶入自定義的業務信息)
9. 【推薦】在獲取協力廠商服務錯誤碼時，向上拋出允許本系統轉義，由 C 轉為 B，並且在錯 誤資訊上帶上原有的協力廠商錯誤碼。
10. 【參考】錯誤碼分為一級宏觀錯誤碼、二級宏觀錯誤碼、三級宏觀錯誤碼。
11. 【參考】錯誤碼的後三位元編號與 HTTP 狀態碼沒有任何關係。
12. 【參考】錯誤碼儘量有利於不同文化背景的開發者進行交流與代碼協作。
13. 【參考】錯誤碼即人性，感性認知+口口相傳，使用純數位來進行錯誤碼編排不利於感性記 憶和分類。

(二) 異常處理
1. 【強制】Java 類庫中定義的可以通過預檢查方式規避的 RuntimeException 異常不應該通過 catch 的方式來處理，比如:NullPointerException，IndexOutOfBoundsException 等等。 
2. 【強制】異常不要用來做流程控制，條件控制。 
3. 【強制】catch 時請分清穩定代碼和非穩定代碼，穩定代碼指的是無論如何不會出錯的代碼。 對於非穩定代碼的 catch 盡可能進行區分異常類型，再做對應的異常處理。
4. 【強制】捕獲異常是為了處理它，不要捕獲了卻什麼都不處理而拋棄之，如果不想處理它， 請將該異常拋給它的調用者。最外層的業務使用者，必須處理異常，將其轉化為使用者可以 理解的內容。
5. 【強制】事務場景中，拋出異常被 catch 後，如果需要回滾，一定要注意手動回滾事務。
6. 【強制】finally 塊必須對資源物件、流物件進行關閉，有異常也要做 try-catch。 說明:如果 JDK7 及以上，可以使用 try-with-resources 方式。
7. 【強制】不要在 finally 塊中使用 return。
8. 【強制】捕獲異常與拋異常，必須是完全匹配，或者捕獲異常是拋異常的父類。 
9. 【強制】在調用 RPC、二方包、或動態生成類的相關方法時，捕捉異常必須使用 Throwable 類來進行攔截。
10. 【推薦】方法的返回值可以為 null，不強制返回空集合，或者空物件等，必須添加注釋充分 說明什麼情況下會返回 null 值。
11. 【強制】防止 NPE，是程式師的基本修養，注意 NPE 產生的場景
12. 【推薦】定義時區分 unchecked / checked 異常，避免直接拋出 new RuntimeException()， 更不允許拋出 Exception 或者 Throwable，應使用有業務含義的自訂異常。推薦業界已定義 過的自訂異常，如:DAOException / ServiceException 等。
13. 【參考】對於公司外的 http/api 開放介面必須使用“錯誤碼”;而應用內部推薦異常拋出; 跨應用間 RPC 調用優先考慮使用 Result 方式，封裝 isSuccess()方法、“錯誤碼”、“錯 誤簡短資訊”;而應用內部推薦異常拋出。
14. 【參考】避免出現重複的代碼(Don't Repeat Yourself)，即 DRY 原則。

(三) 日誌規約
1. 【強制】應用中不可直接使用日誌系統(Log4j、Logback)中的 API，而應依賴使用日誌框架 (SLF4J、JCL--Jakarta Commons Logging)中的 API，使用門面模式的日誌框架，有利於維護和 各個類的日誌處理方式統一。
2. 【強制】所有日誌檔至少保存 15 天，因為有些異常具備以“周”為頻次發生的特點。對於當天日誌，以“應用名.log”來保存，保存在/home/admin/應用名/logs/</font>目錄下， 過往日誌格式為: {logname}.log.{保存日期}，日期格式:yyyy-MM-dd
3. 【強制】應用中的擴展日誌(如打點、臨時監控、訪問日誌等)命名方式:appName_logType_logName.log。logType:日誌類型，如 stats/monitor/access 等;
4. 【強制】在日誌輸出時，字串變數之間的拼接使用預留位置的方式。
5. 【強制】對於 trace/debug/info 級別的日誌輸出，必須進行日誌級別的開關判斷。 說明:雖然在 debug(參數)的方法體內第一行代碼 isDisabled(Level.DEBUG_INT)為真時(Slf4j 的常見實現 Log4j 和 Logback)，就直接 return，但是參數可能會進行字串拼接運算。此外，如果 debug(getName())這種參數內有 getName()方法調用，無謂浪費方法調用的開銷。
6. 【強制】避免重複列印日誌，浪費磁碟空間，務必在 log4j.xml 中設置 additivity=false。 正例:<logger name="com.taobao.dubbo.config" additivity="false">
7. 【強制】生產環境禁止直接使用 System.out 或 System.err 輸出日誌或使用 e.printStackTrace()列印異常堆疊。
8. 【強制】異常資訊應該包括兩類資訊:案發現場資訊和異常堆疊資訊。如果不處理，那麼通過 關鍵字 throws 往上拋出。
9. 【強制】日誌列印時禁止直接用 JSON 工具將物件轉換成 String。
10. 【推薦】謹慎地記錄日誌。生產環境禁止輸出 debug 日誌;有選擇地輸出 info 日誌;如果使 用 warn 來記錄剛上線時的業務行為資訊，一定要注意日誌輸出量的問題，避免把伺服器磁片 撐爆，並記得及時刪除這些觀察日誌。
11. 【推薦】可以使用 warn 日誌級別來記錄使用者輸入參數錯誤的情況，避免使用者投訴時， 無所適從。如非必要，請不要在此場景打出 error 級別，避免頻繁報警。
12. 【推薦】儘量用英文來描述日誌錯誤資訊，如果日誌中的錯誤資訊用英文描述不清楚的話使用中文描述即可，否則容易產生歧義。

 三、單元測試
1. 【強制】好的單元測試必須遵守 AIR 原則。 說明:單元測試線上上運行時，感覺像空氣(AIR)一樣並不存在，但在測試品質的保障上，卻是非常關鍵的。好的單元測試宏觀上來說，具有自動化、獨立性、可重複執行的特點。A:Automatic(自動化) I:Independent(獨立性) R:Repeatable(可重複)
2. 【強制】單元測試應該是全自動執行的，並且非互動式的。測試用例通常是被定期執行的， 執行過程必須完全自動化才有意義。輸出結果需要人工檢查的測試不是一個好的單元測試。 單元測試中不准使用 System.out 來進行人肉驗證，必須使用 assert 來驗證。
3. 【強制】保持單元測試的獨立性。為了保證單元測試穩定可靠且便於維護，單元測試用例之 間決不能互相調用，也不能依賴執行的先後次序。
4. 【強制】單元測試是可以重複執行的，不能受到外界環境的影響。
5. 【強制】對於單元測試，要保證測試細微性足夠小，有助於精確定位問題。單測細微性至多是類 級別，一般是方法級別。
6. 【強制】核心業務、核心應用、核心模組的增量代碼確保單元測試通過。 
7. 【強制】單元測試代碼必須寫在如下工程目錄:src/test/java，不允許寫在業務代碼目錄下。
8. 【推薦】單元測試的基本目標:語句覆蓋率達到 70%;核心模組的語句覆蓋率和分支覆蓋率都 要達到 100%
9. 【推薦】編寫單元測試代碼遵守 BCDE 原則，以保證被測試模組的交付品質。B:Border，邊界值測試，包括迴圈邊界、特殊取值、特殊時間點、資料順序等。 C:Correct，正確的輸入，並得到預期的結果。 D:Design，與設計文檔相結合，來編寫單元測試。 E:Error，強制錯誤資訊輸入(如:非法資料、異常流程、業務允許外等)，並得到預期的結果。
10. 【推薦】對於資料庫相關的查詢，更新，刪除等操作，不能假設資料庫裡的資料是存在的， 或者直接操作資料庫把資料插入進去，請使用程式插入或者導入資料的方式來準備資料。
11. 【推薦】和資料庫相關的單元測試，可以設定自動回滾機制，不給資料庫造成髒資料。或者 對單元測試產生的資料有明確的前尾碼標識。
12. 【推薦】對於不可測的代碼在適當的時機做必要的重構，使代碼變得可測，避免為了達到測 試要求而書寫不規範測試代碼。
13. 【推薦】在設計評審階段，開發人員需要和測試人員一起確定單元測試範圍，單元測試最好 覆蓋所有測試用例(UC)。
14. 【推薦】單元測試作為一種品質保障手段，在專案提測前完成單元測試，不建議專案發佈後 補充單元測試用例。
15. 【參考】為了更方便地進行單元測試，業務代碼應避免以下情況: 構造方法中做的事情過多。存在過多的全域變數和靜態方法。 存在過多的外部依賴。存在過多的條件陳述式。
16. 【參考】不要對單元測試存在如下誤解:
那是測試同學幹的事情。本文是開發手冊，凡是本文內容都是與開發同學強相關的。 單元測試代碼是多餘的。系統的整體功能與各單元部件的測試正常與否是強相關的。 單元測試代碼不需要維護。一年半載後，那麼單元測試幾乎處於廢棄狀態。
單元測試與線上故障沒有辯證關係。好的單元測試能夠最大限度地規避線上故障。

 四、安全規約
1. 【強制】隸屬於使用者個人的頁面或者功能必須進行許可權控制校驗。 
2. 【強制】用戶敏感性資料禁止直接展示，必須對展示資料進行脫敏。 
3. 【強制】用戶輸入的 SQL 參數嚴格使用參數綁定或者 METADATA 欄位值限定，防止 SQL 注入， 禁止字串拼接 SQL 訪問資料庫。
4. 【強制】用戶請求傳入的任何參數必須做有效性驗證。 
5. 【強制】禁止向 HTML 頁面輸出未經安全過濾或未正確轉義的使用者資料。
6. 【強制】表單、AJAX 提交必須執行 CSRF 安全驗證。
7. 【強制】URL 外部重定向傳入的目標位址必須執行白名單過濾。
8. 【強制】在使用平臺資源，譬如短信、郵件、電話、下單、支付，必須實現正確的防重放的機制，如數量限制、疲勞度控制、驗證碼校驗，避免被濫刷而導致資損。風險管控預警、報警管控，對外提供的 api 也應如此。
9. 【推薦】發貼、評論、發送即時消息等使用者生成內容的場景必須實現防刷、文本內容違禁詞過濾等風控策略。

 五、工程結構
 (一) 應用分層
1. 【推薦】圖中默認上層依賴於下層，箭頭關係表示可直接依賴，如:開放介面層可以依賴於 Web 層，也可以直接依賴於 Service 層，依此類推:
• 開放介面層:可直接封裝 Service 方法暴露成 RPC 介面;通過 Web 封裝成 http 介面;閘道控制層等。
• 終端顯示層:各個端的範本渲染並執行顯示的層。當前主要是 velocity 渲染，JS 渲染，JSP 渲染， 移動端展示等。
• Web 層:主要是對存取控制進行轉發，各類基本參數校驗，或者不復用的業務簡單處理等。
• Service 層:相對具體的業務邏輯服務層。
• Manager 層:通用業務處理層，它有如下特徵: 
	1)對協力廠商平臺封裝的層，預處理返回結果及轉化異常資訊。 
	2)對 Service 層通用能力的下沉，如緩存方案、中介軟體通用處理。 
	3)與 DAO 層交互，對多個 DAO 的組合複用。
• DAO 層:資料訪問層，與底層 MySQL、Oracle、Hbase、OB 等進行資料交互。
• 外部介面或協力廠商平臺:包括其它部門 RPC 開放介面，基礎平臺，其它公司的 HTTP 介面。
2. 【參考】(分層異常處理規約)在 DAO 層，產生的異常類型有很多，無法用細細微性的異常進行 catch，使用 catch(Exception e)方式，並 throw new DAOException(e)，不需要列印日誌，因為日誌 在 Manager/Service 層一定需要捕獲並列印到日誌檔中去，如果同台伺服器再打日誌，浪費性能和存儲。在 Service 層出現異常時，必須記錄出錯日誌到磁片，盡可能帶上參數資訊，相當於保護案發現場。Manager 層與 Service 同機部署，日誌方式與 DAO 層處理一致，如果是單獨部署， 則採用與 Service 一致的處理方式。Web 層絕不應該繼續往上拋異常，因為已經處於頂層，如果意識到這個異常將導致頁面無法正常渲染，那麼就應該直接跳轉到友好錯誤頁面，儘量加上友好的錯誤提示資訊(制定 GLOBAL EXCEPTION PAGE)。開放介面層要將異常處理成錯誤碼和錯誤資訊方式返回。
3. 【參考】分層領域模型規約:
• DO(Data Object):此物件與資料庫表結構一一對應，通過 DAO 層向上傳輸資料來源物件。
• DTO(Data Transfer Object):資料傳輸物件，Service 或 Manager 向外傳輸的物件。
• BO(Business Object):業務物件，可以由 Service 層輸出的封裝業務邏輯的物件。
• Query:資料查詢物件，各層接收上層的查詢請求。注意超過 2 個參數的查詢封裝，禁止使用 Map 類 來傳輸。
• VO(View Object):顯示層物件，通常是 Web 向範本渲染引擎層傳輸的物件。

(二) 二方庫依賴
1. 【強制】定義 GAV 遵從以下規則:
1)GroupID 格式:com.{公司/BU }.業務線 [.子業務線]，最多 4 級。
2)ArtifactID 格式:產品線名-模組名。語義不重複不遺漏，先到中央倉庫去查證一下。
2. 【強制】二方庫版本號命名方式:主版本號.次版本號.修訂號 1)主版本號:產品方向改變，或者大規模 API 不相容，或者架構不相容升級。 2)次版本號:保持相對相容性，增加主要功能特性，影響範圍極小的 API 不相容修改。 3)修訂號:保持完全相容性，修復 BUG、新增次要功能特性等。
3. 【強制】線上應用不要依賴 SNAPSHOT 版本(安全包除外);正式發佈的類庫必須先去中央倉 庫進行查證，使 RELEASE 版本號有延續性，且版本號不允許覆蓋升級。
4. 【強制】二方庫的新增或升級，保持除功能點之外的其它 jar 包仲裁結果不變。如果有改變， 必須明確評估和驗證。
5. 【強制】二方庫裡可以定義枚舉類型，參數可以使用枚舉類型，但是介面返回值不允許使用 枚舉類型或者包含枚舉類型的 POJO 物件。
6. 【強制】依賴于一個二方庫群時，必須定義一個統一的版本變數，避免版本號不一致。 說明:依賴 springframework-core,-context,-beans，它們都是同一個版本，可以定義一個變數來保存版 本:${spring.version}，定義依賴的時候，引用該版本。
7. 【強制】禁止在子項目的 pom 依賴中出現相同的 GroupId，相同的 ArtifactId，但是不同的 Version。
8. 【推薦】底層基礎技術框架、核心資料管理平臺、或近硬體端系統謹慎引入協力廠商實現。
9. 【推薦】所有 pom 檔中的依賴聲明放在<dependencies>語句塊中，所有版本仲裁放在<dependencyManagement>語句塊中。
10. 【推薦】二方庫不要有配置項，最低限度不要再增加配置項。 
11. 【推薦】不要使用不穩定的工具包或者 Utils 類。
12. 【參考】為避免應用二方庫的依賴衝突問題，二方庫發佈者應當遵循以下原則:
1)精簡可控原則。移除一切不必要的 API 和依賴，只包含 Service API、必要的領域模型物件、Utils 類、常量、枚舉等。如果依賴其它二方庫，儘量是 provided 引入，讓二方庫使用者去依賴具體版本號;無 log 具體實現，只依賴日誌框架。
2)穩定可追溯原則。每個版本的變化應該被記錄，二方庫由誰維護，源碼在哪裡，都需要能方便查到。 除非用戶主動升級版本，否則公共二方庫的行為不應該發生變化。

(三) 伺服器
1. 【推薦】高併發伺服器建議調小 TCP 協議的 time_wait 超時時間。
2. 【推薦】調大伺服器所支持的最大檔案控制代碼數(File Descriptor，簡寫為 fd)。
3. 【推薦】給 JVM 環境參數設置-XX:+HeapDumpOnOutOfMemoryError 參數，讓 JVM 碰到 OOM 場景時輸出 dump 資訊。
4. 【推薦】線上上生產環境，JVM 的 Xms 和 Xmx 設置一樣大小的記憶體容量，避免在 GC 後調 整堆大小帶來的壓力。
5. 【參考】伺服器內部重定向必須使用 forward;外部重定向位址必須使用 URLBroker 生成， 否則因線上採用 HTTPS 協定而導致流覽器提示“不安全“。此外，還會帶來 URL 維護不一 致的問題。

 六、設計規約
1. 【強制】存儲方案和底層資料結構的設計獲得評審一致通過，並沉澱成為文檔。
2. 【強制】在需求分析階段，如果與系統交互的 User 超過一類並且相關的 User Case 超過 5 個，使用用例圖來表達更加清晰的結構化需求。
3. 【強制】如果某個業務物件的狀態超過 3 個，使用狀態圖來表達並且明確狀態變化的各個觸發條件。
4. 【強制】如果系統中某個功能的調用鏈路上的涉及物件超過 3 個，使用時序圖來表達並且明確各調用環節的輸入與輸出。 
5. 【強制】如果系統中模型類超過 5 個，並且存在複雜的依賴關係，使用類圖來表達並且明確類之間的關係。
6. 【強制】如果系統中超過 2 個物件之間存在協作關係，並且需要表示複雜的處理流程，使用活動圖來表示。
7. 【推薦】系統架構設計時明確以下目標: 確定系統邊界。確定系統在技術層面上的做與不做。確定系統內模組之間的關係。確定模組之間的依賴關係及模組的宏觀輸入與輸出。確定指導後續設計與演化的原則。使後續的子系統或模組設計在一個既定的框架內和技術方向上繼續演化。
8. 【推薦】需求分析與系統設計在考慮主幹功能的同時，需要充分評估異常流程與業務邊界。 
9. 【推薦】類在設計與實現時要符合單一原則。
10. 【推薦】謹慎使用繼承的方式來進行擴展，優先使用聚合/組合的方式來實現。
11. 【推薦】系統設計階段，根據依賴倒置原則，儘量依賴抽象類別與介面，有利於擴展與維護。 
12. 【推薦】系統設計階段，注意對擴展開放，對修改閉合。 
13. 【推薦】系統設計階段，共性業務或公共行為抽取出來公共模組、公共配置、公共類、公共方法等，在系統中不出現重複代碼的情況。
14. 【推薦】避免如下誤解：敏捷開發=講故事+編碼+發布。
15. 【參考】設計文檔的作用是明確需求、理順邏輯、後期維護，次要目的用於指導編碼。 
16. 【參考】可擴展性的本質是找到系統的變化點，並隔離變化點。 
17. 【參考】設計的本質就是識別和表達系統難點。 
18. 【參考】代碼即文檔的觀點是錯誤的，清晰的代碼只是文檔的某個片斷，而不是全部。 
19. 【參考】在做無障礙產品設計時，需要考慮到:所有可交互的控制項元素必須能被 tab 鍵聚焦，並且焦點順序需符合自然操作邏輯。用於登陸校驗和請求攔截的驗證碼均需提供圖形驗證以外的其它方式。自訂的控制項類型需明確對話模式。
