一、程式設計規約 (一) 命名風格
1. 【強制】代碼中的命名均不能以底線或美元符號開始，也不能以底線或美元符號結束。 
2. 【強制】所有程式設計相關的命名嚴禁使用拼音與英文混合的方式，更不允許直接使用中文的方式。
說明:正確的英文拼寫和語法可以讓閱讀者易於理解，避免歧義。注意，純拼音命名方式更要避免採用。
3. 【強制】類名使用 UpperCamelCase 風格，但以下情形例外:DO / BO / DTO / VO / AO /PO / UID 等。
正例:ForceCode / UserDO / HtmlDTO / XmlService / TcpUdpDeal / TaPromotion 反例:forcecode / UserDo / HTMLDto / XMLService / TCPUDPDeal / TAPromotion
4. 【強制】方法名、參數名、成員變數、區域變數都統一使用 lowerCamelCase 風格。 正例:localValue / getHttpMessage() / inputUserId
5. 【強制】常量命名全部大寫，單詞間用底線隔開，力求語義表達完整清楚，不要嫌名字長。 正例:MAX_STOCK_COUNT / CACHE_EXPIRED_TIME
反例:MAX_COUNT / EXPIRED_TIME
6. 【強制】抽象類別命名使用 Abstract 或 Base 開頭;異常類命名使用 Exception 結尾;測 試類命名以它要測試的類的名稱開始，以 Test 結尾。
7. 【強制】類型與中括弧緊挨相連來表示陣列。
8. 【強制】POJO 類中的任何布林類型的變數，都不要加 is 首碼，否則部分框架解析會引起序 列化錯誤。
說明:在本文規約中的建表約定第一條，表達是與否的值採用 is_xxx 的命名方式，所以，需要在 <resultMap>設置從 is_xxx 到 xxx 的映射關係。
9. 【強制】包名統一使用小寫(，)點分隔符號之間有且僅有一個自然語義的英語單詞。包名統一 使用
單數形式，但是類名如果有複數含義，類名可以使用複數形式。
10.【強制】避免在子父類的成員變數之間、或者不同代碼塊的區域變數之間採用完全相同的命名，使可讀性降低。
11.【強制】杜絕完全不規範的縮寫，避免望文不知義。
12.【推薦】為了達到代碼自解釋的目標，任何自訂程式設計元素在命名時，使用儘量完整的單 詞組合來表達。
13.【推薦】在常量與變數的命名時，表示類型的名詞放在詞尾，以提升辨識度。 
14.【推薦】如果模組、介面、類、方法使用了設計模式，在命名時需體現出具體模式。 說明:將設計模式體現在名字中，有利於閱讀者快速理解架構設計理念。
15.【推薦】介面類別中的方法和屬性不要加任何修飾符號(public 也不要加)，保持代碼的 簡潔性，並加上有效的 Javadoc 注釋。儘量不要在介面裡定義變數，如果一定要定義變數， 確定與介面方法相關，並且是整個應用的基礎常量。
16. 介面和實現類的命名有兩套規則:
1)【強制】對於 Service 和 DAO 類，基於 SOA 的理念，暴露出來的服務一定是介面，內部的實現類 用 Impl 的尾碼與介面區別。
2)【推薦】如果是形容能力的介面名稱，取對應的形容詞為介面名(通常是–able 的形容詞)。
17.【參考】枚舉類名帶上 Enum 尾碼，枚舉成員名稱需要全大寫，單詞間用底線隔開。 說明:枚舉其實就是特殊的常量類，且構造方法被默認強制是私有。
18.【參考】各層命名規約:
A) Service/DAO 層方法命名規約
1)獲取單個物件的方法用 get 做首碼。
2)獲取多個物件的方法用 list 做首碼，複數結尾。 
3)獲取統計值的方法用 count 做首碼。
4)插入的方法用 save/insert 做首碼。
5)刪除的方法用 remove/delete 做首碼。
6)修改的方法用 update 做首碼。
B) 領域模型命名規約
1)資料物件:xxxDO，xxx 即為資料表名。 
2)資料傳輸對象:xxxDTO，xxx 為業務領域相關的名稱。3/50
3)展示物件:xxxVO，xxx 一般為網頁名稱。
4) POJO 是 DO/DTO/BO/VO 的統稱，禁止命名成 xxxPOJO。
(二) 常量定義
1. 【強制】不允許任何魔法值(即未經預先定義的常量)直接出現在代碼中。 
2. 【強制】在 long 或者 Long 賦值時，數值後使用大寫的 L，不能是小寫的 l，小寫容易跟數字 混淆，造成誤解。
3. 【推薦】不要使用一個常量類維護所有常量，要按常量功能進行歸類，分開維護。 
4. 【推薦】常量的複用層次有五層:跨應用共用常量、應用內共用常量、子工程內共用常量、包 內共用常量、類內共用常量。
1)跨應用共用常量:放置在二方庫中，通常是 client.jar 中的 constant 目錄下。 
2)應用內共用常量:放置在一方庫中，通常是子模組中的 constant 目錄下。 
3)子工程內部共用常量:即在當前子工程的 constant 目錄下。 
4)包內共用常量:即在當前包下單獨的 constant 目錄下。 
5)類內共用常量:直接在類內部 private static final 定義。
5. 【推薦】如果變數值僅在一個固定範圍內變化用 enum 類型來定義。 說明:如果存在名稱之外的延伸屬性應使用 enum 類型，下面正例中的數位就是延伸資訊，表示一年中的第幾個季節。
(三) 代碼格式
1. 【強制】如果是大括弧內為空，則簡潔地寫成{}即可，大括弧中間無需換行和空格;如果是非 空代碼塊則:
1)左大括弧前不換行。
2)左大括弧後換行。
3)右大括弧前換行。
4)右大括弧後還有 else 等代碼則不換行;表示終止的右大括弧後必須換行。
2. 【強制】左小括弧和右邊相鄰字元之間不出現空格;右小括弧和左邊相鄰字元之間也不出現空 格;而左大括弧前需要加空格。詳見第 5 條下方正例提示。
反例:if (空格 a == b 空格)
3. 【強制】if/for/while/switch/do 等保留字與括弧之間都必須加空格。
4. 【強制】任何二目、三目運算子的左右兩邊都需要加一個空格。
說明:包括設定運算子=、邏輯運算子&&、加減乘除符號等。
5. 【強制】採用 4 個空格縮進，禁止使用 tab 字元。
說明:如果使用 tab 縮進，必須設置 1 個 tab 為 4 個空格。IDEA 設置 tab 為 4 個空格時，請勿勾選 Use tabcharacter;而在 eclipse 中，必須勾選 insert spaces for tabs。
6. 【強制】注釋的雙斜線與注釋內容之間有且僅有一個空格。 正例:
7. 【強制】在進行類型強制轉換時，右括弧與強制轉換值之間不需要任何空格隔開。
8. 【強制】單行字元數限制不超過 120 個，超出需要換行，換行時遵循如下原則: 
1)第二行相對第一行縮進 4 個空格，從第三行開始，不再繼續縮進，參考示例。 
2)運算子與下文一起換行。
3)方法調用的點符號與下文一起換行。 
4)方法調用中的多個參數需要換行時，在逗號後進行。
5)在括弧前不要換行，見反例。 
9. 【強制】方法參數在定義和傳入時，多個參數逗號後邊必須加空格。 正例:下例中實參的 args1，後邊必須要有一個空格。
method(args1, args2, args3);
10.【強制】IDE 的 text file encoding 設置為 UTF-8; IDE 中檔的分行符號使用 Unix 格式，不 要使用 Windows 格式。Web 網頁的編碼也一律使用 UTF-8。
11. 【推薦】單個方法的總行數不超過 80 行。 說明:除注釋之外的方法簽名、左右大括弧、方法內代碼、空行、回車及任何不可見字元的總行數不超過 80 行。
12. 【推薦】沒有必要增加若干空格來使變數的賦值等號與上一行對應位置的等號對齊。 
13. 【推薦】不同邏輯、不同語義、不同業務的代碼之間插入一個空行分隔開來以提升可讀性。 (代碼區塊用空白行隔開)
(四) OOP 規約
1. 【強制】避免通過一個類的物件引用訪問此類的靜態變數或靜態方法，無謂增加編譯器解析 成本，直接用類名來訪問即可。
2. 【強制】所有的覆寫方法，必須加@Override 注解。
3. 【強制】相同參數類型，相同業務含義，才可以使用 Java 的可變參數，避免使用 Object。 說明:可變參數必須放置在參數列表的最後。(提倡同學們儘量不用可變參數程式設計) 
4. 【強制】外部正在調用或者二方庫依賴的介面，不允許修改方法簽名，避免對介面調用方產生影 響。介面過時必須加@Deprecated 注解，並清晰地說明採用的新介面或者新服務是什麼。
5. 【強制】不能使用過時的類或方法。說明:java.net.URLDecoder 中的方法 decode(String encodeStr)這個方法已經過時，應該使用雙參數 decode(String source, String encode)。介面提供方既然明確是過時介面，那麼有義務同時提供新的介面; 作為調用方來說，有義務去考證過時方法的新實現是什麼。
6. 【強制】Object 的 equals 方法容易拋空指針異常，應使用常量或確定有值的物件來調用 equals。 正例:"test".equals(object);
7. 【強制】所有整型包裝類物件之間值的比較，全部使用 equals 方法比較。
說明:對於 Integer var = ?在-128 至 127 之間的賦值，Integer 物件是在 IntegerCache.cache 產生， 會複用已有物件，這個區間內的 Integer 值可以直接使用==進行判斷，但是這個區間之外的所有資料， 都會在堆上產生，並不會複用已有物件，這是一個大坑，推薦使用 equals 方法進行判斷。
8. 【強制】任何貨幣金額，均以最小貨幣單位且整型類型來進行存儲。
9. 【強制】浮點數之間的等值判斷，基底資料型別不能用==來比較，包裝資料類型不能用 equals
來判斷。
10. 【強制】定義資料物件 DO 類時，屬性類型要與資料庫欄位類型相匹配。
11. 【強制】禁止使用構造方法 BigDecimal(double)的方式把 double 值轉化為 BigDecimal 物件。
12. 關於基底資料型別與包裝資料類型的使用標準如下: 1)【強制】所有的 POJO 類屬性必須使用包裝資料類型。 2)【強制】RPC 方法的返回值和參數必須使用包裝資料類型。 3)【推薦】所有的區域變數使用基底資料型別。
13. 【強制】定義 DO/DTO/VO 等 POJO 類時，不要設定任何屬性預設值。
14. 【強制】序列化類新增屬性時，請不要修改 serialVersionUID 欄位，避免反序列失敗;如 果完全不相容升級，避免反序列化混亂，那麼請修改 serialVersionUID 值。
15. 【強制】構造方法裡面禁止加入任何業務邏輯，如果有初始化邏輯，請放在 init 方法中。
16. 【強制】POJO 類必須寫 toString 方法。使用 IDE 中的工具:source> generate toString 時，如果繼承了另一個 POJO 類，注意在前面加一下 super.toString。
17. 【強制】禁止在 POJO 類中，同時存在對應屬性 xxx 的 isXxx()和 getXxx()方法。Boolean
值使用 isXxx()非布林值使用 getXxx()。
18. 【推薦】使用索引訪問用 String 的 split 方法得到的陣列時，需做最後一個分隔符號後有無
內容的檢查，否則會有拋 IndexOutOfBoundsException 的風險。
19. 【推薦】當一個類有多個構造方法，或者多個同名方法，這些方法應該按順序放置在一起， 便於閱讀，此條規則優先於下一條。
20. 【推薦】類內方法定義的順序依次是:公有方法或保護方法>私有方法> getter / setter 方 法。
21. 【推薦】setter 方法中，參數名稱與類成員變數名稱一致，this.成員名=參數名。在
22. 【推薦】循環體內，字串的連接方式，使用 StringBuilder 的 append 方法進行擴展。
23. 【推薦】final 可以聲明類、成員變數、方法、以及本地變數，下列情況使用 final 關鍵字: 
1)不允許被繼承的類，如:String 類。
2)不允許修改引用的域對象，如:POJO 類的域變數。
3)不允許被覆寫的方法，如:POJO 類的 setter 方法。
4)不允許運行過程中重新賦值的區域變數。
5)避免上下文重複使用一個變數，使用 final 可以強制重新定義一個變數，方便更好地進行重構。
24. 【推薦】慎用 Object 的 clone 方法來拷貝物件。
25. 【推薦】類成員與方法存取控制從嚴:
1)如果不允許外部直接通過 new 來創建物件，那麼構造方法必須是 private。 2)工具類不允許有 public 或 default 構造方法。
3)類非 static 成員變數並且與子類共用，必須是 protected。
4)類非 static 成員變數並且僅在本類使用，必須是 private。
5)類 static 成員變數如果僅在本類使用，必須是 private。
6)若是 static 成員變數，考慮是否為 final。10/50
7)類成員方法只供類內部調用，必須是 private。 
8)類成員方法只對繼承類公開，那麼限制為 protected。

(五) 日期時間
1. 【強制】日期格式化時，傳入 pattern 中表示年份統一使用小寫的 y。
2. 【強制】在日期格式中分清楚大寫的 M 和小寫的 m，大寫的 H 和小寫的 h 分別指代的意義。 
3. 【強制】獲取當前毫秒數:System.currentTimeMillis();而不是 new Date().getTime()。
4. 【強制】不允許在程式任何地方中使用:1)java.sql.Date 2)java.sql.Time 3) java.sql.Timestamp。
5. 【強制】不要在程式中寫死一年為 365 天，避免在西曆閏年時出現日期轉換錯誤或程式邏 輯錯誤。
6. 【推薦】避免西曆閏年 2 月問題。閏年的 2 月份有 29 天，一年後的那一天不可能是 2 月 29 日。
7. 【推薦】使用枚舉值來指代月份。如果使用數字，注意 Date，Calendar 等日期相關類的月份 month 取值在 0-11 之間。

(六) 集合處理
1. 【強制】關於 hashCode 和 equals 的處理，遵循如下規則: 
1)只要重寫 equals，就必須重寫 hashCode。
2)因為 Set 存儲的是不重複的物件，依據 hashCode 和 equals 進行判斷，所以 Set 存儲的物件必須重 寫這兩個方法。
3)如果自訂物件作為 Map 的鍵，那麼必須覆寫 hashCode 和 equals。
2. 【強制】判斷所有集合內部的元素是否為空，使用 isEmpty()方法，而不是 size()==0 的方式。
3. 【強制】在使用 java.util.stream.Collectors 類的 toMap()方法轉為 Map 集合時，一定要使用 含有參數類型為 BinaryOperator，參數名為 mergeFunction 的方法，否則當出現相同 key
值時會拋出 IllegalStateException 異常。
4. 【強制】在使用 java.util.stream.Collectors 類的 toMap()方法轉為 Map 集合時，一定要注
意當 value 為 null 時會拋 NPE 異常。
5. java.util.RandomAccessSubList cannot be cast to java.util.ArrayList。
【強制】ArrayList 的 subList 結果不可強轉成 ArrayList，否則會拋出 ClassCastException 異常: 
6. 【強制】使用 Map 的方法 keySet()/values()/entrySet()返回集合物件時，不可以對其進行添
加元素操作，否則會拋出 UnsupportedOperationException 異常。
7. 【強制】Collections 類返回的對象，如:emptyList()/singletonList()等都是 immutable list， 不可對其進行添加或者刪除元素的操作。
8. 【強制】在 subList 場景中，高度注意對父集合元素的增加或刪除，均會導致子列表的遍歷、 增加、刪除產生 ConcurrentModificationException 異常。
9. 【強制】使用集合轉陣列的方法，必須使用集合的 toArray(T[] array)，傳入的是類型完全一 致、長度為 0 的空陣列。
10. 【強制】在使用 Collection 介面任何實現類的 addAll()方法時，都要對輸入的集合參數進 行 NPE 判斷。
說明:在 ArrayList#addAll 方法的第一行代碼即 Object[] a = c.toArray();其中 c 為輸入集合參數，如果 為 null，則直接拋出異常。
11. 【強制】使用工具類 Arrays.asList()把陣列轉換成集合時，不能使用其修改集合相關的方法， 它的 add/remove/clear 方法會拋出 UnsupportedOperationException 異常。
12. 【強制】泛型萬用字元<? extends T>來接收返回的資料，此寫法的泛型集合不能使用 add 方 法，而<? super T>不能使用 get 方法，兩者在介面調用賦值的場景中容易出錯。
13. 【強制】在無泛型限制定義的集合賦值給泛型限制的集合時，在使用集合元素時，需要進 行 instanceof 判斷，避免拋出 ClassCastException 異常。
14. 【強制】不要在 foreach 迴圈裡進行元素的 remove/add 操作。remove 元素請使用 Iterator 方式，如果併發操作，需要對 Iterator 物件加鎖。
15. 【強制】在 JDK7 版本及以上，Comparator 實現類要滿足如下三個條件，不然 Arrays.sort， Collections.sort 會拋 IllegalArgumentException 異常。
16. 【推薦】集合泛型定義時，在 JDK7 及以上，使用 diamond 語法或全省略。 說明:菱形泛型，即 diamond，直接使用<>來指代前邊已經指定的類型。
17. 【推薦】集合初始化時，指定集合初始值大小。
18. 【推薦】使用 entrySet 遍歷 Map 類集合 KV，而不是 keySet 方式進行遍歷。
19. 【推薦】高度注意 Map 類集合 K/V 能不能存儲 null 值的情況，如下表格: 
20. 【參考】合理利用好集合的有序性(sort)和穩定性(order)，避免集合的無序性(unsort)和不 穩定性(unorder)帶來的負面影響。
21. 【參考】利用 Set 元素唯一的特性，可以快速對一個集合進行去重操作，避免使用 List 的 contains()進行遍歷去重或者判斷包含操作。

 (七) 併發處理
1. 【強制】獲取單例物件需要保證執行緒安全，其中的方法也要保證執行緒安全。 說明:資源驅動類、工具類、單例工廠類都需要注意。
2. 【強制】創建執行緒或執行緒池時請指定有意義的執行緒名稱，方便出錯時回溯。
3. 【強制】執行緒資源必須通過執行緒池提供，不允許在應用中自行顯式創建執行緒。 說明:執行緒池的好處是減少在創建和銷毀執行緒上所消耗的時間以及系統資源的開銷，解決資源不足的問
題。 如果不使用執行緒池，有可能造成系統創建大量同類執行緒而導致消耗完記憶體或者“過度切換”的問題。
4. 【強制】執行緒池不允許使用 Executors 去創建，而是通過 ThreadPoolExecutor 的方式， 這樣的處理方式讓寫的同學更加明確執行緒池的運行規則，規避資源耗盡的風險。
說明:Executors 返回的執行緒池對象的弊端如下: 1)FixedThreadPool 和 SingleThreadPool:
允許的請求佇列長度為 Integer.MAX_VALUE，可能會堆積大量的請求，從而導致 OOM。 2)CachedThreadPool:
允許的創建執行緒數量為 Integer.MAX_VALUE，可能會創建大量的執行緒，從而導致 OOM。
5. 【強制】SimpleDateFormat 是執行緒不安全的類，一般不要定義為 static 變數，如果定義為 static，
必須加鎖，或者使用 DateUtils 工具類。
6. 【強制】必須回收自訂的 ThreadLocal 變數，尤其在執行緒池場景下，執行緒經常會被覆用， 如果不清理自訂的 ThreadLocal 變數，可能會影響後續業務邏輯和造成記憶體洩露等問題。
儘量在代理中使用 try-finally 塊進行回收。
7. 【強制】高併發時，同步調用應該去考量鎖的性能損耗。能用無鎖資料結構，就不要用鎖;能 鎖區塊，就不要鎖整個方法體;能用物件鎖，就不要用類鎖。 
8. 【強制】對多個資源、資料庫表、物件同時加鎖時，需要保持一致的加鎖順序，否則可能會造 成鎖死。
9. 【強制】在使用阻塞等待獲取鎖的方式中，必須在 try 代碼塊之外，並且在加鎖方法與 try 代 碼塊之間沒有任何可能拋出異常的方法調用，避免加鎖成功後，在 finally 中無法解鎖。
10. 【強制】在使用嘗試機制來獲取鎖的方式中，進入業務代碼塊之前，必須先判斷當前執行緒是否 持有鎖。鎖的釋放規則與鎖的阻塞等待方式相同。
11. 【強制】併發修改同一記錄時，避免更新丟失，需要加鎖。要麼在應用層加鎖，要麼在緩存 加鎖，要麼在資料庫層使用樂觀鎖，使用 version 作為更新依據。
12. 【強制】多執行緒並行處理定時任務時，Timer 運行多個 TimeTask 時，只要其中之一沒有捕 獲拋出的異常，其它任務便會自動終止運行，使用 ScheduledExecutorService 則沒有這個問題。
13. 【推薦】資金相關的金融敏感資訊，使用悲觀鎖策略。
14. 【推薦】使用 CountDownLatch 進行非同步轉同步操作，每個執行緒退出前必須調用 countDown 方法，執行緒執行代碼注意 catch 異常，確保 countDown 方法被執行到，避免主 執行緒無法執行至 await 方法，直到超時才返回結果。
15. 【推薦】避免 Random 實例被多執行緒使用，雖然共用該實例是執行緒安全的，但會因競爭同一 seed
導致的性能下降。
16.【推薦】通過雙重檢查鎖(double-checked locking)(在併發場景下)實現延遲初始化的優化 問題隱患(可參考 The"Double-Checked Locking is Broken"Declaration)，推薦解決方案中較為簡 單一種(適用於 JDK5 及以上版本)，將目標屬性聲明為 volatile 型(比如修改 helper 的屬
性聲明為`private volatile Helper helper = null;`)。
17.【參考】volatile 解決多執行緒記憶體不可見問題。對於一寫多讀，是可以解決變數同步問題， 但
是如果多寫，同樣無法解決執行緒安全問題。
說明:如果是 count++操作，使用如下類實現:AtomicInteger count = new AtomicInteger();count.addAndGet(1); 如果是 JDK8，推薦使用 LongAdder 物件，比 AtomicLong 性 能更好(減少樂觀鎖的重試次數)。
18. 【參考】HashMap 在容量不夠進行 resize 時由於高併發可能出現死鏈，導致 CPU 飆升， 在開發過程中注意規避此風險。
19. 【參考】ThreadLocal 物件使用 static 修飾，ThreadLocal 無法解決共用物件的更新問題。

(八) 控制語句
1. 【強制】在一個 switch 塊內，每個 case 要麼通過 continue/break/return 等來終止，要麼注釋 說明程式將繼續執行到哪一個 case 為止;在一個 switch 塊內，都必須包含一個 default語句並且放在最後，即使它什麼代碼也沒有。
2. 【強制】當 switch 括弧內的變數類型為 String 並且此變數為外部參數時，必須先進行 null 判斷。
3. 【強制】在 if/else/for/while/do 語句中必須使用大括弧。 說明:即使只有一行代碼，禁止不採用大括弧的編碼方式:if (condition) statements;
4. 【強制】三目運算子 condition?運算式 1 :運算式 2 中，高度注意運算式 1 和 2 在類型對齊 時，可能拋出因自動拆箱導致的 NPE 異常。 
5. 【強制】在高併發場景中，避免使用”等於”判斷作為中斷或退出的條件。
6. 【推薦】當某個方法的代碼行數超過 10 行時，return / throw 等中斷邏輯的右大括弧後加一 個空行。
7. 【推薦】表達異常的分支時，少用 if-else 方式，這種方式可以改寫成:
8. 【推薦】除常用方法(如 getXxx/isXxx)等外，不要在條件判斷中執行其它複雜的語句，將複 雜邏輯判斷的結果賦值給一個有意義的布林變數名，以提高可讀性。
9. 【推薦】不要在其它運算式(尤其是條件運算式)中，插入設定陳述式。
說明:賦值點類似於人體的穴位，對於代碼的理解至關重要，所以設定陳述式需要清晰地單獨成為一行。
反例:
publicLockgetLock(boolean fair) {
// 算術運算式中出現賦值操作，容易忽略 count 值已經被改變 threshold=(count = Integer.MAX_VALUE)-1;
// 條件運算式中出現賦值操作，容易誤認為是 sync==fair return(sync=fair)?newFairSync(): new NonfairSync();
}
10. 【推薦】循環體中的語句要考量性能，以下操作儘量移至循環體外處理，如定義物件、變數、 獲取資料庫連接，進行不必要的 try-catch 操作(這個 try-catch 是否可以移至循環體外)。
11. 【推薦】避免採用取反邏輯運算子。 說明:取反邏輯不利於快速理解，並且取反邏輯寫法必然存在對應的正向邏輯寫法。 正例:使用 if (x < 628)來表達 x 小於 628。
反例:使用 if (!(x >= 628))來表達 x 小於 628。
12. 【推薦】介面入參保護，這種場景常見的是用作批量操作的介面。 反例:某業務系統，提供一個使用者批量查詢的介面，API 文檔上有說最多查多少個，但介面實現上沒做
任何保護，導致調用方傳了一個 1000 的使用者 id 陣列過來後，查詢資訊後，記憶體爆了。
13. 【參考】下列情形，需要進行參數校驗: 1)調用頻次低的方法。
2)執行時間開銷很大的方法。此情形中，參數校驗時間幾乎可以忽略不計，但如果因為參數錯誤導致 中間執行回退，或者錯誤，那得不償失。
3)需要極高穩定性和可用性的方法。 4)對外提供的開放介面，不管是 RPC/API/HTTP 介面。 5)敏感許可權入口。
14. 【參考】下列情形，不需要進行參數校驗: 1)極有可能被迴圈調用的方法。但在方法說明裡必須注明外部參數檢查。
2)底層調用頻度比較高的方法。畢竟是像純淨水過濾的最後一道，參數錯誤不太可能到底層才會暴露問 題。一般 DAO 層與 Service 層都在同一個應用中，部署在同一台伺服器中，所以 DAO 的參數校驗，可 以省略。
3)被聲明成 private 只會被自己代碼所調用的方法，如果能夠確定調用方法的代碼傳入參數已經做過檢 查或者肯定不會有問題，此時可以不校驗參數。
 23/50

Java 開發手冊
 (九) 注釋規約
1. 【強制】類、類屬性、類方法的注釋必須使用 Javadoc 規範，使用/**內容*/格式，不得使用 // xxx 方式。
說明:在 IDE 編輯視窗中，Javadoc 方式會提示相關注釋，生成 Javadoc 可以正確輸出相應注釋;在 IDE 中，工程調用方法時，不進入方法即可懸浮提示方法、參數、返回值的意義，提高閱讀效率。
2. 【強制】所有的抽象方法(包括介面中的方法)必須要用 Javadoc 注釋、除了返回值、參數、 異常說明外，還必須指出該方法做什麼事情，實現什麼功能。 說明:對子類的實現要求，或者調用注意事項，請一併說明。
3. 【強制】所有的類都必須添加創建者和創建日期。
說明:在設置範本時，注意 IDEA 的@author 為`${USER}`，而 eclipse 的@author 為`${user}`，大小寫
有區別，而日期的設置統一為 yyyy/MM/dd 的格式。 正例:
/**
* @author yangguanbao * @date 2016/10/31
*/
4. 【強制】方法內部單行注釋，在被注釋語句上方另起一行，使用//注釋。方法內部多行注釋 使用/* */注釋，注意與代碼對齊。
5. 【強制】所有的枚舉類型欄位必須要有注釋，說明每個資料項目的用途。
6. 【推薦】與其“半吊子”英文來注釋，不如用中文注釋把問題說清楚。專有名詞與關鍵字保持 英文原文即可。
反例:“TCP 連接逾時”解釋成“傳輸控制協議連接逾時”，理解反而費腦筋。
7. 【推薦】代碼修改的同時，注釋也要進行相應的修改，尤其是參數、返回值、異常、核心邏輯 等的修改。
說明:代碼與注釋更新不同步，就像路網與導航軟體更新不同步一樣，如果導航軟體嚴重滯後，就失去了 導航的意義。
8. 【推薦】在類中刪除未使用的任何欄位和方法;在方法中刪除未使用的任何參數聲明與內部 變數。
9. 【參考】謹慎注釋掉代碼。在上方詳細說明，而不是簡單地注釋掉。如果無用，則刪除。
說明:代碼被注釋掉有兩種可能性:1)後續會恢復此段代碼邏輯。2)永久不用。前者如果沒有備註資訊， 難以知曉注釋動機。後者建議直接刪掉即可，假如需要查閱歷史代碼，登錄代碼倉庫即可。
24/50

Java 開發手冊
10. 【參考】對於注釋的要求:第一、能夠準確反映設計思想和代碼邏輯;第二、能夠描述業務 含義，使別的程式師能夠迅速瞭解到代碼背後的資訊。完全沒有注釋的大段代碼對於閱讀者 形同天書，注釋是給自己看的，即使隔很長時間，也能清晰理解當時的思路;注釋也是給繼 任者看的，使其能夠快速接替自己的工作。
11. 【參考】好的命名、代碼結構是自解釋的，注釋力求精簡準確、表達到位。避免出現注釋的一 個極端:過多過濫的注釋，代碼的邏輯一旦修改，修改注釋是相當大的負擔。
反例:
// put elephant into fridge
put(elephant,fridge);
方法名 put，加上兩個有意義的變數名 elephant 和 fridge，已經說明了這是在幹什麼，語義清晰的代碼
不需要額外的注釋。
12. 【參考】特殊注釋標記，請注明標記人與標記時間。注意及時處理這些標記，通過標記掃描， 經常清理此類標記。線上故障有時候就是來源於這些標記處的代碼。
1)待辦事宜(TODO):(標記人，標記時間，[預計處理時間]) 表示需要實現，但目前還未實現的功能。這實際上是一個 Javadoc 的標籤，目前的 Javadoc 還沒有
實現，但已經被廣泛使用。只能應用於類，介面和方法(因為它是一個 Javadoc 標籤)。 2)錯誤，不能工作(FIXME):(標記人，標記時間，[預計處理時間])
在注釋中用 FIXME 標記某代碼是錯誤的，而且不能工作，需要及時糾正的情況。
(十) 其它
1. 【強制】在使用規則運算式時，利用好其預編譯功能，可以有效加快正則匹配速度。 說明:不要在方法體內定義:Pattern pattern = Pattern.compile(“規則”);
2. 【強制】避免用 Apache Beanutils 進行屬性的 copy。
說明:Apache BeanUtils 性能較差，可以使用其他方案比如 Spring BeanUtils, Cglib BeanCopier，注
意均是淺拷貝。
3. 【強制】velocity 調用 POJO 類的屬性時，直接使用屬性名取值即可，範本引擎會自動按規範調用 POJO 的 getXxx()，如果是 boolean 基底資料型別變數(boolean 命名不需要加 is 首碼)，會自動調 用 isXxx()方法。
說明:注意如果是 Boolean 包裝類物件，優先調用 getXxx()的方法。
4. 【強制】後臺輸送給頁面的變數必須加$!{var}——中間的感嘆號。
說明:如果 var 等於 null 或者不存在，那麼${var}會直接顯示在頁面上。JSP 使用 Tag 標籤需先創建 Tag 文件，將信息寫入 Tag 文件中，JSP 引用后調用 Tag 文件即可。
5. 【強制】注意 Math.random()這個方法返回是 double 類型，注意取值的範圍 0≤x<1(能夠取 到零值，注意除零異常)，如果想獲取整數類型的亂數，不要將 x 放大 10 的若干倍然後取 整，直接使用 Random 物件的 nextInt 或者 nextLong 方法。
   25/50

Java 開發手冊
6. 【推薦】不要在視圖範本中加入任何複雜的邏輯。
說明:根據 MVC 理論，視圖的職責是展示，不要搶模型和控制器的活。
7. 【推薦】任何資料結構的構造或初始化，都應指定大小，避免資料結構無限增長吃光記憶體。
8. 【推薦】及時清理不再使用的程式碼片段或配置資訊。 說明:對於垃圾代碼或過時配置，堅決清理乾淨，避免程式過度臃腫，代碼冗餘。 正例:對於暫時被注釋掉，後續可能恢復使用的代碼片斷，在注釋代碼上方，統一規定使用三個斜杠(///) 來說明注釋掉代碼的理由。如:
public static void hello() {
/// 業務方通知活動暫停
// Business business = new Business(); // business.active(); System.out.println("it's finished");
}
 26/50

Java 開發手冊
 二、異常日誌 (一) 錯誤碼
1. 【強制】錯誤碼的制定原則:快速溯源、簡單易記、溝通標準化。 說明:錯誤碼想得過於完美和複雜，就像康熙字典中的生僻字一樣，用詞似乎精准，但是字典不容易隨身
攜帶並且簡單易懂。
正例:錯誤碼回答的問題是誰的錯?錯在哪?1)錯誤碼必須能夠快速知曉錯誤來源，可快速判斷是誰的 問題。2)錯誤碼易於記憶和比對(代碼中容易 equals)。3)錯誤碼能夠脫離文檔和系統平臺達到線下 輕量化地自由溝通的目的。
2. 【強制】錯誤碼不體現版本號和錯誤等級資訊。 說明:錯誤碼以不斷追加的方式進行相容。錯誤等級由日誌和錯誤碼本身的釋義來決定。
3. 【強制】全部正常，但不得不填充錯誤碼時返回五個零:00000。(表示執行成功)
4. 【強制】錯誤碼為字串類型，共 5 位元，分成兩個部分:錯誤產生來源+四位元數位編號。
(四位數使用區間分辨不同類型的錯誤)
說明:錯誤產生來源分為 A/B/C，A 表示錯誤來源於使用者，比如參數錯誤，使用者安裝版本過低，用戶 支付超時等問題;B 表示錯誤來源於當前系統，往往是業務邏輯出錯，或程式健壯性差等問題;C 表示錯 誤來源於協力廠商服務，比如 CDN 服務出錯，消息投遞超時等問題;四位元數字編號從 0001 到 9999， 大類之間的步長間距預留 100，參考文末附表 3。
5. 【強制】編號不與公司業務架構，更不與組織架構掛鉤，一切與平臺先到先申請的原則進行， 審批生效，編號即被永久固定。
6. 【強制】錯誤碼使用者避免隨意定義新的錯誤碼。 說明:盡可能在原有錯誤碼附表中找到語義相同或者相近的錯誤碼在代碼中使用即可。
7. 【強制】錯誤碼不能直接輸出給使用者作為提示資訊使用。 說明:堆疊(stack_trace)、錯誤資訊(error_message)、錯誤碼(error_code)、提示資訊(user_tip)
是一個有效關聯並互相轉義的和諧整體，但是請勿互相越俎代庖。
8. 【推薦】錯誤碼之外的業務獨特資訊由 error_message 來承載，而不是讓錯誤碼本身涵蓋 過多具體業務屬性。(使用參數可帶入自定義的業務信息)
9. 【推薦】在獲取協力廠商服務錯誤碼時，向上拋出允許本系統轉義，由 C 轉為 B，並且在錯 誤資訊上帶上原有的協力廠商錯誤碼。
10. 【參考】錯誤碼分為一級宏觀錯誤碼、二級宏觀錯誤碼、三級宏觀錯誤碼。
說明:在無法更加具體確定的錯誤場景中，可以直接使用一級宏觀錯誤碼，分別是:A0001(使用者端錯誤)、 27/50
 
Java 開發手冊
B0001(系統執行出錯)、C0001(調用協力廠商服務出錯)。 正例:調用協力廠商服務出錯是一級，中介軟體錯誤是二級，消息服務出錯是三級。
11. 【參考】錯誤碼的後三位元編號與 HTTP 狀態碼沒有任何關係。
12. 【參考】錯誤碼儘量有利於不同文化背景的開發者進行交流與代碼協作。
說明:英文單詞形式的錯誤碼不利於非英語母語國家(如阿拉伯語、希伯來語、俄羅斯語等)之間的開發 者互相協作。
13. 【參考】錯誤碼即人性，感性認知+口口相傳，使用純數位來進行錯誤碼編排不利於感性記 憶和分類。
說明:數位是一個整體，每位元數字的地位和含義是相同的。
反例:一個五位元數位 12345，第 1 位元是錯誤等級，第 2 位元是錯誤來源，345 是編號，人的大腦不會
主動地分辨每位元數位的不同含義。
(二) 異常處理
1. 【強制】Java 類庫中定義的可以通過預檢查方式規避的 RuntimeException 異常不應該通過 catch 的方式來處理，比如:NullPointerException，IndexOutOfBoundsException 等等。 說明:無法通過預檢查的異常除外，比如，在解析字串形式的數位時，可能存在數位格式錯誤，不得不 通過 catch NumberFormatException 來實現。
正例:if (obj != null) {...}
反例:try { obj.method();} catch (NullPointerException e) {...}
2. 【強制】異常不要用來做流程控制，條件控制。 說明:異常設計的初衷是解決程式運行中的各種意外情況，且異常的處理效率比條件判斷方式要低很多。
3. 【強制】catch 時請分清穩定代碼和非穩定代碼，穩定代碼指的是無論如何不會出錯的代碼。 對於非穩定代碼的 catch 盡可能進行區分異常類型，再做對應的異常處理。
說明:對大段代碼進行 try-catch，使程式無法根據不同的異常做出正確的應激反應，也不利於定位問題， 這是一種不負責任的表現。
正例:使用者註冊的場景中，如果使用者輸入非法字元，或用戶名稱已存在，或使用者輸入密碼過於簡單， 在程式上作出分門別類的判斷，並提示給用戶。
4. 【強制】捕獲異常是為了處理它，不要捕獲了卻什麼都不處理而拋棄之，如果不想處理它， 請將該異常拋給它的調用者。最外層的業務使用者，必須處理異常，將其轉化為使用者可以 理解的內容。
5. 【強制】事務場景中，拋出異常被 catch 後，如果需要回滾，一定要注意手動回滾事務。
28/50
 
Java 開發手冊
6. 【強制】finally 塊必須對資源物件、流物件進行關閉，有異常也要做 try-catch。 說明:如果 JDK7 及以上，可以使用 try-with-resources 方式。
7. 【強制】不要在 finally 塊中使用 return。
說明:try 塊中的 return 語句執行成功後，並不馬上返回，而是繼續執行 finally 塊中的語句，如果此處存
在 return 語句，則在此直接返回，無情丟棄掉 try 塊中的返回點。
反例:
private int x=0;
public int checkReturn() { try{
// x 等於 1，此處不返回
return++x; } finally {
// 返回的結果是 2
return++x; }
}
8. 【強制】捕獲異常與拋異常，必須是完全匹配，或者捕獲異常是拋異常的父類。 說明:如果預期對方拋的是繡球，實際接到的是鉛球，就會產生意外情況。
9. 【強制】在調用 RPC、二方包、或動態生成類的相關方法時，捕捉異常必須使用 Throwable 類來進行攔截。
說明:通過反射機制來調用方法，如果找不到方法，拋出 NoSuchMethodException。什麼情況會拋出 NoSuchMethodError 呢?二方包在類衝突時，仲裁機制可能導致引入非預期的版本使類的方法簽名不匹 配，或者在位元組碼修改框架(比如:ASM)動態創建或修改類時，修改了相應的方法簽名。這些情況， 即使代碼編譯期是正確的，但在代碼運行期時，會拋出 NoSuchMethodError。
10. 【推薦】方法的返回值可以為 null，不強制返回空集合，或者空物件等，必須添加注釋充分 說明什麼情況下會返回 null 值。
說明:本手冊明確防止 NPE 是調用者的責任。即使被調用方法返回空集合或者空物件，對調用者來說，也 並非高枕無憂，必須考慮到遠端調用失敗、序列化失敗、運行時異常等場景返回 null 的情況。
11. 【強制】防止 NPE，是程式師的基本修養，注意 NPE 產生的場景: 1)返回類型為基底資料型別，return 包裝資料類型的物件時，自動拆箱有可能產生 NPE。
反例:public int f() { return Integer 物件}，如果為 null，自動解箱拋 NPE。 2)資料庫的查詢結果可能為 null。
3)集合裡的元素即使 isNotEmpty，取出的資料元素也可能為 null。 4)遠端調用返回物件時，一律要求進行空指標判斷，防止 NPE。
5)對於 Session 中獲取的資料，建議進行 NPE 檢查，避免空指針。
6)級聯調用 obj.getA().getB().getC();一連串調用，易產生 NPE。 正例:使用 JDK8 的 Optional 類來防止 NPE 問題。
 29/50

Java 開發手冊
12. 【推薦】定義時區分 unchecked / checked 異常，避免直接拋出 new RuntimeException()， 更不允許拋出 Exception 或者 Throwable，應使用有業務含義的自訂異常。推薦業界已定義 過的自訂異常，如:DAOException / ServiceException 等。
13. 【參考】對於公司外的 http/api 開放介面必須使用“錯誤碼”;而應用內部推薦異常拋出; 跨應用間 RPC 調用優先考慮使用 Result 方式，封裝 isSuccess()方法、“錯誤碼”、“錯 誤簡短資訊”;而應用內部推薦異常拋出。
說明:關於 RPC 方法返回方式使用 Result 方式的理由: 1)使用拋異常返回方式，調用方如果沒有捕獲到就會產生執行階段錯誤。
2)如果不加棧資訊，只是 new 自訂異常，加入自己的理解的 error message，對於調用端解決問題的幫助 不會太多。如果加了棧資訊，在頻繁調用出錯的情況下，資料序列化和傳輸的性能損耗也是問題。自定異常將 stacktrace 拋出。
14. 【參考】避免出現重複的代碼(Don't Repeat Yourself)，即 DRY 原則。 說明:隨意複製和粘貼代碼，必然會導致代碼的重複，在以後需要修改時，需要修改所有的副本，容易遺漏。
必要時抽取共性方法，或者抽象公共類，甚至是元件化。
正例:一個類中有多個 public 方法，都需要進行數行相同的參數校驗操作，這個時候請抽取: private boolean checkParam(DTO dto) {...}
(三) 日誌規約
1. 【強制】應用中不可直接使用日誌系統(Log4j、Logback)中的 API，而應依賴使用日誌框架 (SLF4J、JCL--Jakarta Commons Logging)中的 API，使用門面模式的日誌框架，有利於維護和 各個類的日誌處理方式統一。
說明:日誌框架(SLF4J、JCL--Jakarta Commons Logging)的使用方式(推薦使用 SLF4J)，SLF4J 用 绑定的 jar 包，而 JCL 是通過配置文件來指定日誌實現，SLF4J 受類加載器的影響較小，不易產生內存溢出 的問題。
使用 SLF4J:
importorg.slf4j.Logger;
importorg.slf4j.LoggerFactory;
private static final Logger logger=LoggerFactory.getLogger(Test.class); 使用 JCL:
importorg.apache.commons.logging.Log; importorg.apache.commons.logging.LogFactory;
private static final Log log=LogFactory.getLog(Test.class);
2. 【強制】所有日誌檔至少保存 15 天，因為有些異常具備以“周”為頻次發生的特點。對於當天
日誌，以“應用名.log”來保存，保存在/home/admin/應用名/logs/</font>目錄下， 過往日誌格式為: {logname}.log.{保存日期}，日期格式:yyyy-MM-dd
說明:以 mppserver 應用為例，日誌保存在/home/admin/mppserver/logs/mppserver.log，歷史日 誌名稱為 mppserver.log.2016-08-01
3. 【強制】應用中的擴展日誌(如打點、臨時監控、訪問日誌等)命名方式:
appName_logType_logName.log。logType:日誌類型，如 stats/monitor/access 等;logName:日誌描
 30/50

Java 開發手冊
 述。這種命名的好處:通過檔案名就可知道日誌檔屬於什麼應用，什麼類型，什麼目的，也有利於歸類查 找。
說明:推薦對日誌進行分類，如將錯誤日誌和業務日誌分開存放，便於開發人員查看，也便於通過日誌對 系統進行及時監控。
正例:mppserver 應用中單獨監控時區轉換異常，如:mppserver_monitor_timeZoneConvert.log
4. 【強制】在日誌輸出時，字串變數之間的拼接使用預留位置的方式。
說明:因為 String 字串的拼接會使用 StringBuilder 的 append()方式，有一定的性能損耗。使用預留位 置僅是替換動作，可以有效提升性能。
正例:logger.debug("Processing trade with id: {} and symbol: {}", id, symbol); 反例:logger.debug("Processing trade with id: ”+id+” and symbol: “+symbol);
5. 【強制】對於 trace/debug/info 級別的日誌輸出，必須進行日誌級別的開關判斷。 說明:雖然在 debug(參數)的方法體內第一行代碼 isDisabled(Level.DEBUG_INT)為真時(Slf4j 的常見實現
Log4j 和 Logback)，就直接 return，但是參數可能會進行字串拼接運算。此外，如果 debug(getName())這種參數內有 getName()方法調用，無謂浪費方法調用的開銷。
正例:
// 如果判斷為真，那麼可以輸出 trace 和 debug 級別的日誌
if (logger.isDebugEnabled()) {
logger.debug("Current ID is: {} and name is: {}", id,getName());
}
6. 【強制】避免重複列印日誌，浪費磁碟空間，務必在 log4j.xml 中設置 additivity=false。 正例:<logger name="com.taobao.dubbo.config" additivity="false">
7. 【強制】生產環境禁止直接使用 System.out 或 System.err 輸出日誌或使用 e.printStackTrace()列印異常堆疊。
說明:標準日誌輸出與標準錯誤輸出檔每次 Jboss 重啟時才滾動，如果大量輸出送往這兩個檔，容易造 成檔大小超過作業系統大小限制。Log.error(“訊息”, exception);
8. 【強制】異常資訊應該包括兩類資訊:案發現場資訊和異常堆疊資訊。如果不處理，那麼通過 關鍵字 throws 往上拋出。
正例:logger.error(各類參數或者對象 toString() + "_" + e.getMessage(), e);可以分次打印不要用拼接 字串的方式一次打印。
9. 【強制】日誌列印時禁止直接用 JSON 工具將物件轉換成 String。
說明:如果物件裡某些 get 方法被重寫，存在拋出異常的情況，則可能會因為列印日誌而影響正常業務
流程的執行。
正例:列印日誌時僅列印出業務相關屬性值或者調用其物件的 toString()方法。
10. 【推薦】謹慎地記錄日誌。生產環境禁止輸出 debug 日誌;有選擇地輸出 info 日誌;如果使 用 warn 來記錄剛上線時的業務行為資訊，一定要注意日誌輸出量的問題，避免把伺服器磁片 撐爆，並記得及時刪除這些觀察日誌。
31/50

Java 開發手冊
 說明:大量地輸出無效日誌，不利於系統性能提升，也不利於快速定位錯誤點。記錄日誌時請思考:這些 日誌真的有人看嗎?看到這條日誌你能做什麼?能不能給問題排查帶來好處?
11. 【推薦】可以使用 warn 日誌級別來記錄使用者輸入參數錯誤的情況，避免使用者投訴時， 無所適從。如非必要，請不要在此場景打出 error 級別，避免頻繁報警。
說明:注意日誌輸出的級別，error 級別只記錄系統邏輯出錯、異常或者重要的錯誤資訊。
12. 【推薦】儘量用英文來描述日誌錯誤資訊，如果日誌中的錯誤資訊用英文描述不清楚的話使
用中文描述即可，否則容易產生歧義。
說明:國際化團隊或海外部署的伺服器由於字元集問題，使用全英文來注釋和描述日誌錯誤資訊。 服務器字元集統一使用 UTF-8 字元集，訊息進行 I18N。
32/50

Java 開發手冊
 三、單元測試
1. 【強制】好的單元測試必須遵守 AIR 原則。 說明:單元測試線上上運行時，感覺像空氣(AIR)一樣並不存在，但在測試品質的保障上，卻是非常關
鍵的。好的單元測試宏觀上來說，具有自動化、獨立性、可重複執行的特點。
A:Automatic(自動化) I:Independent(獨立性) R:Repeatable(可重複)
2. 【強制】單元測試應該是全自動執行的，並且非互動式的。測試用例通常是被定期執行的， 執行過程必須完全自動化才有意義。輸出結果需要人工檢查的測試不是一個好的單元測試。 單元測試中不准使用 System.out 來進行人肉驗證，必須使用 assert 來驗證。
3. 【強制】保持單元測試的獨立性。為了保證單元測試穩定可靠且便於維護，單元測試用例之 間決不能互相調用，也不能依賴執行的先後次序。
反例:method2 需要依賴 method1 的執行，將執行結果作為 method2 的輸入。
4. 【強制】單元測試是可以重複執行的，不能受到外界環境的影響。
說明:單元測試通常會被放到持續集成中，每次有代碼 check in 時單元測試都會被執行。如果單測對外 部環境(網路、服務、中介軟體等)有依賴，容易導致持續集成機制的不可用。
正例:為了不受外界環境影響，要求設計代碼時就把 SUT 的依賴改成注入，在測試時用 spring 這樣的 DI 框架注入一個本地(記憶體)實現或者 Mock 實現。
5. 【強制】對於單元測試，要保證測試細微性足夠小，有助於精確定位問題。單測細微性至多是類 級
別，一般是方法級別。
說明:只有測試細微性小才能在出錯時儘快定位到出錯位置。單測不負責檢查跨類或者跨系統的交互邏輯， 那是集成測試(SIT)的領域。
6. 【強制】核心業務、核心應用、核心模組的增量代碼確保單元測試通過。 說明:新增代碼及時補充單元測試，如果新增代碼影響了原有單元測試，請及時修正。
7. 【強制】單元測試代碼必須寫在如下工程目錄:src/test/java，不允許寫在業務代碼目錄下。 說明:源碼編譯時會跳過此目錄，而單元測試框架預設是掃描此目錄。
8. 【推薦】單元測試的基本目標:語句覆蓋率達到 70%;核心模組的語句覆蓋率和分支覆蓋率都 要達到 100%
說明:在工程規約的應用分層中提到的 DAO 層，Manager 層，可重用度高的 Service，都應該進行單元 測試。
33/50

Java 開發手冊
9. 【推薦】編寫單元測試代碼遵守 BCDE 原則，以保證被測試模組的交付品質。
B:Border，邊界值測試，包括迴圈邊界、特殊取值、特殊時間點、資料順序等。 C:Correct，正確的輸入，並得到預期的結果。 D:Design，與設計文檔相結合，來編寫單元測試。 E:Error，強制錯誤資訊輸入(如:非法資料、異常流程、業務允許外等)，並得到預期的結果。
10. 【推薦】對於資料庫相關的查詢，更新，刪除等操作，不能假設資料庫裡的資料是存在的， 或者直接操作資料庫把資料插入進去，請使用程式插入或者導入資料的方式來準備資料。
反例:刪除某一行資料的單元測試，在資料庫中，先直接手動增加一行作為刪除目標，但是這一行新增資 料並不符合業務插入規則，導致測試結果異常。
11. 【推薦】和資料庫相關的單元測試，可以設定自動回滾機制，不給資料庫造成髒資料。或者 對單元測試產生的資料有明確的前尾碼標識。
正例:在單元測試中，使用 ENTERPRISE_INTELLIGENCE _UNIT_TEST_的首碼來標識單元測試相關代 碼。
12. 【推薦】對於不可測的代碼在適當的時機做必要的重構，使代碼變得可測，避免為了達到測 試要求而書寫不規範測試代碼。
13. 【推薦】在設計評審階段，開發人員需要和測試人員一起確定單元測試範圍，單元測試最好 覆蓋所有測試用例(UC)。
14. 【推薦】單元測試作為一種品質保障手段，在專案提測前完成單元測試，不建議專案發佈後 補充單元測試用例。
15. 【參考】為了更方便地進行單元測試，業務代碼應避免以下情況: 構造方法中做的事情過多。
存在過多的全域變數和靜態方法。 存在過多的外部依賴。
存在過多的條件陳述式。 說明:多層條件陳述式建議使用衛語句、策略模式、狀態模式等方式重構。
16. 【參考】不要對單元測試存在如下誤解:
那是測試同學幹的事情。本文是開發手冊，凡是本文內容都是與開發同學強相關的。 單元測試代碼是多餘的。系統的整體功能與各單元部件的測試正常與否是強相關的。 單元測試代碼不需要維護。一年半載後，那麼單元測試幾乎處於廢棄狀態。
單元測試與線上故障沒有辯證關係。好的單元測試能夠最大限度地規避線上故障。
 34/50

Java 開發手冊
 四、安全規約
1. 【強制】隸屬於使用者個人的頁面或者功能必須進行許可權控制校驗。 說明:防止沒有做水準許可權校驗就可隨意訪問、修改、刪除別人的資料，比如查看他人的私信內容。
2. 【強制】用戶敏感性資料禁止直接展示，必須對展示資料進行脫敏。 說明:中國大陸個人手機號碼顯示為:137****0969，隱藏中間 4 位，防止隱私洩露。
3. 【強制】用戶輸入的 SQL 參數嚴格使用參數綁定或者 METADATA 欄位值限定，防止 SQL 注入， 禁止字串拼接 SQL 訪問資料庫。
反例:某系統簽名大量被惡意修改，即是因為對於危險字元# --沒有進行轉義，導致資料庫更新時， where 後邊的資訊被注釋掉，對全庫進行更新。使用 HQL 可減少 SQL 解析時間、降低內存消耗、防止 SQL 注入、避免使用拼湊 SQL 語句的方式。
4. 【強制】用戶請求傳入的任何參數必須做有效性驗證。 說明:忽略參數校驗可能導致:
page size 過大導致記憶體溢出
惡意 order by 導致資料庫慢查 詢緩存擊穿
SSRF 任意重定向
SQL 注入，Shell 注入，反序列化注 入正則輸入源串拒絕服務 ReDoS
Java 代碼用正則來驗證用戶端的輸入，有些正則寫法驗證普通用戶輸入沒有問題，但是如果攻擊人員使 用的是特殊構造的字串來驗證，有可能導致閉環的結果。
5. 【強制】禁止向 HTML 頁面輸出未經安全過濾或未正確轉義的使用者資料。
6. 【強制】表單、AJAX 提交必須執行 CSRF 安全驗證。
說明:CSRF(Cross-site request forgery)跨站請求偽造是一類常見程式設計漏洞。對於存在 CSRF 漏洞的 應用/網站，攻擊者可以事先構造好 URL，只要受害者用戶一訪問，後臺便在使用者不知情的情況下對資 料庫中使用者參數進行相應修改。
7. 【強制】URL 外部重定向傳入的目標位址必須執行白名單過濾。
8. 【強制】在使用平臺資源，譬如短信、郵件、電話、下單、支付，必須實現正確的防重放的機
制，如數量限制、疲勞度控制、驗證碼校驗，避免被濫刷而導致資損。風險管控預警、報警管 控，對外提供的 api 也應如此。
說明:如註冊時發送驗證碼到手機，如果沒有限制次數和頻率，那麼可以利用此功能騷擾到其它用戶，並
造成短信平臺資源浪費。
9. 【推薦】發貼、評論、發送即時消息等使用者生成內容的場景必須實現防刷、文本內容違禁
詞過濾等風控策略。
35/50

Java 開發手冊
 五、工程結構 (一) 應用分層
1. 【推薦】圖中默認上層依賴於下層，箭頭關係表示可直接依賴，如:開放介面層可以依賴於 Web 層，也可以直接依賴於 Service 層，依此類推:
 • 開放介面層:可直接封裝 Service 方法暴露成 RPC 介面;通過 Web 封裝成 http 介面;閘道控制層等。
• 終端顯示層:各個端的範本渲染並執行顯示的層。當前主要是 velocity 渲染，JS 渲染，JSP 渲染， 移動端展示等。
• Web 層:主要是對存取控制進行轉發，各類基本參數校驗，或者不復用的業務簡單處理等。
• Service 層:相對具體的業務邏輯服務層。
• Manager 層:通用業務處理層，它有如下特徵: 1)對協力廠商平臺封裝的層，預處理返回結果及轉化異常資訊。 2)對 Service 層通用能力的下沉，如緩存方案、中介軟體通用處理。 3)與 DAO 層交互，對多個 DAO 的組合複用。
• DAO 層:資料訪問層，與底層 MySQL、Oracle、Hbase、OB 等進行資料交互。
• 外部介面或協力廠商平臺:包括其它部門 RPC 開放介面，基礎平臺，其它公司的 HTTP 介面。
2. 【參考】(分層異常處理規約)在 DAO 層，產生的異常類型有很多，無法用細細微性的異常進行 catch，使用 catch(Exception e)方式，並 throw new DAOException(e)，不需要列印日誌，因為日誌 在 Manager/Service 層一定需要捕獲並列印到日誌檔中去，如果同台伺服器再打日誌，浪費性能 和存儲。在 Service 層出現異常時，必須記錄出錯日誌到磁片，盡可能帶上參數資訊，相當於保護 案發現場。Manager 層與 Service 同機部署，日誌方式與 DAO 層處理一致，如果是單獨部署， 則採用與 Service 一致的處理方式。Web 層絕不應該繼續往上拋異常，因為已經處於頂層，如果 意識到這個異常將導致頁面無法正常渲染，那麼就應該直接跳轉到友好錯誤頁面，儘量加上友好 的錯誤提示資訊(制定 GLOBAL EXCEPTION PAGE)。開放介面層要將異常處理成錯誤碼和錯誤資 訊方式返回。
36/50

Java 開發手冊
 3. 【參考】分層領域模型規約:
• DO(Data Object):此物件與資料庫表結構一一對應，通過 DAO 層向上傳輸資料來源物件。
• DTO(Data Transfer Object):資料傳輸物件，Service 或 Manager 向外傳輸的物件。
• BO(Business Object):業務物件，可以由 Service 層輸出的封裝業務邏輯的物件。
• Query:資料查詢物件，各層接收上層的查詢請求。注意超過 2 個參數的查詢封裝，禁止使用 Map 類 來傳輸。
• VO(View Object):顯示層物件，通常是 Web 向範本渲染引擎層傳輸的物件。
(二) 二方庫依賴
1. 【強制】定義 GAV 遵從以下規則:
1)GroupID 格式:com.{公司/BU }.業務線 [.子業務線]，最多 4 級。
說明:{公司/BU}例如:alibaba/taobao/tmall/aliexpress 等 BU 一級;子業務線可選。
正例:com.taobao.jstorm 或 com.alibaba.dubbo.register
2)ArtifactID 格式:產品線名-模組名。語義不重複不遺漏，先到中央倉庫去查證一下。
正例:dubbo-client / fastjson-api / jstorm-tool 3)Version:詳細規定參考下方。
2. 【強制】二方庫版本號命名方式:主版本號.次版本號.修訂號 1)主版本號:產品方向改變，或者大規模 API 不相容，或者架構不相容升級。 2)次版本號:保持相對相容性，增加主要功能特性，影響範圍極小的 API 不相容修改。 3)修訂號:保持完全相容性，修復 BUG、新增次要功能特性等。
說明:注意起始版本號必須為:1.0.0，而不是 0.0.1。1 以下的版本都是測試版。 反例:倉庫內某二方庫版本號從 1.0.0.0 開始，一直默默“升級”成 1.0.0.64，完全失去版本的語義資訊。
3. 【強制】線上應用不要依賴 SNAPSHOT 版本(安全包除外);正式發佈的類庫必須先去中央倉 庫進行查證，使 RELEASE 版本號有延續性，且版本號不允許覆蓋升級。
說明:不依賴 SNAPSHOT 版本是保證應用發佈的冪等性。另外，也可以加快編譯時的打包構建。
4. 【強制】二方庫的新增或升級，保持除功能點之外的其它 jar 包仲裁結果不變。如果有改變， 必須明確評估和驗證。
說明:在升級時，進行 dependency:resolve 前後資訊比對，如果仲裁結果完全不一致，那麼通過 dependency:tree 命令，找出差異點，進行<exclude>排除 jar 包。
5. 【強制】二方庫裡可以定義枚舉類型，參數可以使用枚舉類型，但是介面返回值不允許使用 枚舉類型或者包含枚舉類型的 POJO 物件。
 37/50

Java 開發手冊
6. 【強制】依賴于一個二方庫群時，必須定義一個統一的版本變數，避免版本號不一致。 說明:依賴 springframework-core,-context,-beans，它們都是同一個版本，可以定義一個變數來保存版 本:${spring.version}，定義依賴的時候，引用該版本。
7. 【強制】禁止在子項目的 pom 依賴中出現相同的 GroupId，相同的 ArtifactId，但是不同的 Version。
說明:在本地調試時會使用各子專案指定的版本號，但是合併成一個 war，只能有一個版本號出現在最後 的 lib 目錄中。曾經出現過線下調試是正確的，發佈到線上卻出故障的先例。
8. 【推薦】底層基礎技術框架、核心資料管理平臺、或近硬體端系統謹慎引入協力廠商實現。
9. 【推薦】所有 pom 檔中的依賴聲明放在<dependencies>語句塊中，所有版本仲裁放在
<dependencyManagement>語句塊中。
說明:<dependencyManagement>裡只是聲明版本，並不實現引入，因此子專案需要顯式的聲明依賴， version 和 scope 都讀取自父 pom。而<dependencies>所有聲明在主 pom 的<dependencies>裡的依 賴都會自動引入，並預設被所有的子項目繼承。
10. 【推薦】二方庫不要有配置項，最低限度不要再增加配置項。 11. 【推薦】不要使用不穩定的工具包或者 Utils 類。
說明:不穩定指的是提供方無法做到向下相容，在編譯階段正常，但在運行時產生異常，因此，儘量使用 業界穩定的二方工具包。
12. 【參考】為避免應用二方庫的依賴衝突問題，二方庫發佈者應當遵循以下原則:
1)精簡可控原則。移除一切不必要的 API 和依賴，只包含 Service API、必要的領域模型物件、Utils 類、 常量、枚舉等。如果依賴其它二方庫，儘量是 provided 引入，讓二方庫使用者去依賴具體版本號;無 log 具體實現，只依賴日誌框架。
2)穩定可追溯原則。每個版本的變化應該被記錄，二方庫由誰維護，源碼在哪裡，都需要能方便查到。 除非用戶主動升級版本，否則公共二方庫的行為不應該發生變化。
(三) 伺服器
1. 【推薦】高併發伺服器建議調小 TCP 協議的 time_wait 超時時間。
說明:作業系統預設 240 秒後，才會關閉處於 time_wait 狀態的連接，在高併發訪問下，伺服器端會因
為處於 time_wait 的連接數太多，可能無法建立新的連接，所以需要在伺服器上調小此等待值。 正例:在 linux 伺服器上請通過變更/etc/sysctl.conf 檔去修改該缺省值(秒):
net.ipv4.tcp_fin_timeout = 30
2. 【推薦】調大伺服器所支持的最大檔案控制代碼數(File Descriptor，簡寫為 fd)。
說明:主流作業系統的設計是將 TCP/UDP 連接採用與檔一樣的方式去管理，即一個連接對應於一個 fd。主流的 linux 伺服器默認所支持最大 fd 數量為 1024，當併發連接數很大時很容易因為 fd 不足而出現“open
 38/50

Java 開發手冊
 too many files”錯誤，導致新的連接無法建立。建議將 linux 伺服器所支持的最大控制碼數調高數倍 (與伺服器的記憶體數量相關)。
3. 【推薦】給 JVM 環境參數設置-XX:+HeapDumpOnOutOfMemoryError 參數，讓 JVM 碰到 OOM
場景時輸出 dump 資訊。
說明:OOM 的發生是有概率的，甚至相隔數月才出現一例，出錯時的堆內資訊對解決問題非常有幫助。
4. 【推薦】線上上生產環境，JVM 的 Xms 和 Xmx 設置一樣大小的記憶體容量，避免在 GC 後調 整堆大小帶來的壓力。
5. 【參考】伺服器內部重定向必須使用 forward;外部重定向位址必須使用 URLBroker 生成， 否則因線上採用 HTTPS 協定而導致流覽器提示“不安全“。此外，還會帶來 URL 維護不一 致的問題。
39/50

Java 開發手冊
 六、設計規約
1. 【強制】存儲方案和底層資料結構的設計獲得評審一致通過，並沉澱成為文檔。
說明:有缺陷的底層資料結構容易導致系統風險上升，可擴展性下降，重構成本也會因歷史資料移轉和系 統平滑過渡而陡然增加，所以，存儲方案和資料結構需要認真地進行設計和評審，生產環境提交執行後， 需要進行 double check。
正例:評審內容包括存儲介質選型、表結構設計能否滿足技術方案、存取性能和存儲空間能否滿足業務發 展、表或欄位之間的辯證關係、欄位名稱、欄位類型、索引等;資料結構變更(如在原有表中新增欄位) 也需要進行評審通過後上線。
2. 【強制】在需求分析階段，如果與系統交互的 User 超過一類並且相關的 User Case 超過 5 個， 使用用例圖來表達更加清晰的結構化需求。
3. 【強制】如果某個業務物件的狀態超過 3 個，使用狀態圖來表達並且明確狀態變化的各個觸發 條件。
說明:狀態圖的核心是物件狀態，首先明確物件有多少種狀態，然後明確兩兩狀態之間是否存在直接轉換 關係，再明確觸發狀態轉換的條件是什麼。
正例:訂單狀態有已下單、待付款、已付款、待發貨、已發貨、已收貨等。比如已下單與已收貨這兩種狀 態之間是不可能有直接轉換關係的。
4. 【強制】如果系統中某個功能的調用鏈路上的涉及物件超過 3 個，使用時序圖來表達並且明確 各調用環節的輸入與輸出。 說明:時序圖反映了一系列物件間的交互與協作關係，清晰立體地反映系統的調用縱深鏈路。
5. 【強制】如果系統中模型類超過 5 個，並且存在複雜的依賴關係，使用類圖來表達並且明確類 之間的關係。
說明:類圖像建築領域的施工圖，如果搭平房，可能不需要，但如果建造螞蟻 Z 空間大樓，肯定需要詳 細的施工圖。
6. 【強制】如果系統中超過 2 個物件之間存在協作關係，並且需要表示複雜的處理流程，使用活 動圖來表示。
說明:活動圖是流程圖的擴展，增加了能夠體現協作關係的物件泳道，支援表示併發等。
7. 【推薦】系統架構設計時明確以下目標: 確定系統邊界。確定系統在技術層面上的做與不做。 確定系統內模組之間的關係。確定模組之間的依賴關係及模組的宏觀輸入與輸出。
確定指導後續設計與演化的原則。使後續的子系統或模組設計在一個既定的框架內和技術方向上 繼續演化。
40/50

Java 開發手冊 確定非功能性需求。非功能性需求是指安全性、可用性、可擴展性等。
8. 【推薦】需求分析與系統設計在考慮主幹功能的同時，需要充分評估異常流程與業務邊界。 反例:用戶在付款過程中，銀行扣款成功，發送給用戶扣款成功短信，但是入款時由於斷網演練產生異常，
訂單頁面依然顯示未付款，導致使用者投訴。
9. 【推薦】類在設計與實現時要符合單一原則。
說明:單一原則最易理解卻是最難實現的一條規則，隨著系統演進，很多時候，忘記了類設計的初衷。 10. 【推薦】謹慎使用繼承的方式來進行擴展，優先使用聚合/組合的方式來實現。
說明:不得已使用繼承的話，必須符合裡氏代換原則，此原則說父類能夠出現的地方子類一定能夠出現， 比如，“把錢交出來”，錢的子類美元、歐元、人民幣等都可以出現。
11. 【推薦】系統設計階段，根據依賴倒置原則，儘量依賴抽象類別與介面，有利於擴展與維護。 說明:低層次模組依賴於高層次模組的抽象，方便系統間的解耦。
12. 【推薦】系統設計階段，注意對擴展開放，對修改閉合。 說明:極端情況下，交付的代碼是不可修改的，同一業務域內的需求變化，通過模組或類的擴展來實現。
13. 【推薦】系統設計階段，共性業務或公共行為抽取出來公共模組、公共配置、公共類、公共 方法等，在系統中不出現重複代碼的情況。
說明:隨著代碼的重複次數不斷增加，維護成本指數級上升。 14. 【推薦】避免如下誤解:敏捷開發=講故事+編碼+發佈。
說明:敏捷開發是快速交付反覆運算可用的系統，省略多餘的設計方案，摒棄傳統的審批流程，但核心關 鍵點上的必要設計和文檔沉澱是需要的。
反例:某團隊為了業務快速發展，敏捷成了產品經理催進度的藉口，系統中均是勉強能運行但像麵條一樣 的代碼，可維護性和可擴展性極差，一年之後，不得不進行大規模重構，得不償失。
15. 【參考】設計文檔的作用是明確需求、理順邏輯、後期維護，次要目的用於指導編碼。 說明:避免為了設計而設計，系統設計文檔有助於後期的系統維護和重構，所以設計結果需要進行分類歸
檔保存。
16. 【參考】可擴展性的本質是找到系統的變化點，並隔離變化點。 說明:世間眾多設計模式其實就是一種設計模式即隔離變化點的模式。 正例:極致擴展性的標誌，就是需求的新增，不會在原有代碼交付物上進行任何形式的修改。
17. 【參考】設計的本質就是識別和表達系統難點。 說明:識別和表達完全是兩回事，很多人錯誤地認為識別到系統難點在哪裡，表達只是自然而然的事情，但是
大家在設計評審中經常出現語焉不詳，甚至是詞不達意的情況。準確地表達系統難點需要具備如下能
 41/50

Java 開發手冊
 力:表達規則和表達工具的熟練性。抽象思維和總結能力的局限性。基礎知識體系的完備性。深入淺出的 生動表達力。
18. 【參考】代碼即文檔的觀點是錯誤的，清晰的代碼只是文檔的某個片斷，而不是全部。 說明:代碼的深度調用，模組層面上的依賴關係網，業務場景邏輯，非功能性需求等問題是需要相應的文
檔來完整地呈現的。
19. 【參考】在做無障礙產品設計時，需要考慮到:
說明:所有可交互的控制項元素必須能被 tab 鍵聚焦，並且焦點順序需符合自然操作邏輯。用於登陸校 驗和請求攔截的驗證碼均需提供圖形驗證以外的其它方式。
自訂的控制項類型需明確對話模式。
正例:使用者登陸場景中，輸入框的按鈕都需要考慮 tab 鍵聚焦，符合自然邏輯的操作順序如下，“輸 入用戶名，輸入密碼，輸入驗證碼，點擊登錄”，其中驗證碼實現語音驗證方式。如果有自訂標籤實現的 控制項設置控制項類型可使用 role 屬性。
42/50

Java 開發手冊
  附 1:版本歷史
      版本號
版本名
發佈日期
備註
         1.0.0
 初版
 2019.05.29
     中原資訊總處系統開發處精益管理系統開發中心
  43/50

附 2:專有名詞解釋
Java 開發手冊
  1. CAS(Compare And Swap):專指資料庫表一一對應的 POJO 類。解決多執行緒並行情況下使 用鎖造成性能損耗的一種機制，這是硬體實現的原子操作。CAS 操作包含三個運算元:記憶 體位置、預期原值和新值。如果記憶體位置的值與預期原值相匹配，那麼處理器會自動將該 位置值更新為新值。否則，處理器不做任何操作。
2. DO(Data Object):專指資料庫表一一對應的 POJO 類。
3. GAV(GroupId、ArtifactId、Version): Maven 座標，是用來唯一標識 jar 包。
4. OOP(Object Oriented Programming):本文泛指類、物件的程式設計處理方式。
5. AQS(AbstractQueuedSynchronizer):利用先進先出佇列實現的底層同步工具類，它是很多上層 同步實現類的基礎，比如:ReentrantLock、CountDownLatch、Semaphore 等，它們通過繼 承 AQS 實現其模版方法，然後將 AQS 子類作為同步元件的內部類，通常命名為 Sync。
6. ORM(Object Relation Mapping):物件關係映射，物件領域模型與底層資料之間的轉換，本 文泛指 iBATIS, mybatis 等框架。
7. POJO(Plain Ordinary Java Object):在本規約中，POJO 專指只有 setter/getter/toString 的 簡單類，包括 DO/DTO/BO/VO 等。
8. AO(Application Object):專指 Application Object，即在 Service 層上，極為貼近業務的複 用代碼。
9. NPE(java.lang.NullPointerException):空指針異常。
10. OOM(Out Of Memory):源於 java.lang.OutOfMemoryError，當 JVM 沒有足夠的記憶體
來為物件分配空間並且垃圾回收器也無法回收空間時，系統出現的嚴重狀況。 11. 一方庫: 本工程內部子專案模組依賴的庫(jar 包)。
12. 二方庫: 公司內部發佈到中央倉庫，可供公司內部其它應用依賴的庫(jar 包)。 13. 三方庫: 公司之外的開源庫(jar 包)。
      44/50

Java 開發手冊
 附 3:錯誤碼清單
            錯誤碼錯誤碼
  00000 一切 ok
正確執行後的返回 一級宏觀錯誤碼 二級宏觀錯誤碼
   A0001
   A0100
   A0101
   A0102
   A0110
   A0111
   A0112
   A0113
   A0120
   A0121
    A0122
   A0130
   A0131
   A0132
   A0133
   A0140
   A0141
   A0142
   A0143
   A0144
   A0150 使用者基本資訊校驗失敗
 A0151
A0152
A0153
A0200
中文描述 中文描述
使用者端錯誤
使用者註冊錯誤
使用者未同意隱私協議
註冊國家或地區受限
用戶名校驗失敗
用戶名已存在
用戶名包含敏感詞
用戶名包含特殊字元
密碼校驗失敗
密碼長度不夠
密碼強度不夠
校驗碼輸入錯誤
短信校驗碼輸入錯誤
郵件校驗碼輸入錯誤
語音校驗碼輸入錯誤
用戶證件異常
用戶證件類型未選擇
大陸身份證編號校驗非法
護照編號校驗非法
軍官證編號校驗非法
手機格式校驗失敗
地址格式校驗失敗
郵箱格式校驗失敗
用戶登陸異常
說明 說明
           二級宏觀錯誤碼
   A0201 用戶帳戶不存在
   45/50

A0202
A0203
A0210
A0211
A0220
A0221
A0222
A0223
A0230
A0240
A0241
A0300
A0301
A0302
A0303
A0310
A0311
A0312
A0320
A0321
A0322
A0323
A0324
A0325
A0330
A0340
A0341
A0400
A0401
用戶帳戶被凍結
用戶帳戶已作廢
使用者密碼錯誤
使用者輸入密碼次數超限
用戶身份校驗失敗
用戶指紋識別失敗
用戶面容識別失敗
用戶未獲得協力廠商登陸授權
用戶登陸已過期
使用者驗證碼錯誤
用戶驗證碼嘗試次數超限
存取權限異常
訪問未授權
正在授權中
用戶授權申請被拒絕
因訪問物件隱私設置被攔截
授權已過期
無許可權使用 API
用戶訪問被攔截
黑名單用戶
帳號被凍結
非法 IP 地址
閘道訪問受限
地域黑名單
服務已欠費
Java 開發手冊
                                     二級宏觀錯誤碼
                                          用戶簽名異常
   RSA 簽名錯誤
   使用者請求參數錯誤
包含非法惡意跳轉連結
二級宏觀錯誤碼
      A0402 無效的用戶輸入
    46/50

A0410
A0411
A0412
A0413
A0414
A0420
A0421
A0422
A0423
A0424
A0425
A0426
A0427
A0430
A0431
A0432
A0433
A0440
A0441
A0442
A0443
A0500
A0501
A0502
A0503
A0504
A0505
A0506
A0600
請求必填參數為空
使用者訂單號為空
訂購數量為空
缺少時間戳記參數
非法的時間戳記參數
請求參數值超出允許的範圍
參數格式不匹配
位址不在服務範圍
時間不在服務範圍
金額超出限制
數量超出限制
請求批量處理總個數超出限制
請求 JSON 解析失敗
使用者輸入內容非法
包含違禁敏感詞
圖片包含違禁資訊
文件侵犯版權
用戶操作異常
用戶支付超時
確認訂單超時
訂單已關閉
使用者請求服務異常
請求次數超出限制
請求併發數超出限制
用戶操作請等待
Java 開發手冊
                                                                   二級宏觀錯誤碼
            WebSocket 連接異常
   WebSocket 連接斷開
   用戶重複請求
   用戶資源異常
二級宏觀錯誤碼
   A0601 帳戶餘額不足
    47/50

A0602
A0603
A0604
A0605
A0700
A0701
A0702
A0703
A0704
A0705
A0800
A0801
A0802
A0803
A0804
A0805
A0806
A0807
A0900
A0901
A0902
A0903
A0904
A0905
A0906
A0907
A1000
A1001
A1002
使用者磁碟空間不足
使用者記憶體空間不足
使用者 OSS 容量不足
用戶配額已用光
用戶上傳檔異常
用戶上傳檔案類型不匹配
用戶上傳檔太大
使用者上傳圖片太大
使用者上傳視頻太大
用戶上傳壓縮檔太大
用戶當前版本異常
使用者安裝版本與系統不匹配
用戶安裝版本過低
用戶安裝版本過高
用戶安裝版本已過期
用戶 API 請求版本不匹配
用戶 API 請求版本過高
用戶 API 請求版本過低
用戶隱私未授權
用戶隱私未簽署
用戶攝像頭未授權
用戶相機未授權
使用者圖片庫未授權
用戶檔未授權
使用者位置資訊未授權
Java 開發手冊
            螞蟻森林澆水數或每天抽獎數
二級宏觀錯誤碼
二級宏觀錯誤碼
                                              二級宏觀錯誤碼
                     用戶通訊錄未授權
   使用者設備異常
用戶相機異常
使用者麥克風異常
二級宏觀錯誤碼
         A1003 用戶聽筒異常
    48/50

A1004
A1005
B0001
B0100
B0101
B0200
B0210
B0220
B0300
B0310
B0311
B0312
B0313
B0314
B0315
B0320
B0321
C0001
C0100
C0110
C0111
C0112
C0113
C0120
C0121
C0122
C0123
用戶揚聲器異常
用戶 GPS 定位異常
系統執行出錯
系統執行超時
系統訂單處理超時
系統容災功能被觸發
系統限流
系統功能降級
系統資源異常
系統資源耗盡
系統磁碟空間耗盡
系統記憶體耗盡
檔案控制代碼耗盡
系統連接池耗盡
系統執行緒池耗盡
系統資源訪問異常
系統讀取磁片檔失敗
調用協力廠商服務出錯
中介軟體服務出錯
RPC 服務出錯
RPC 服務未找到
RPC 服務未註冊
Java 開發手冊
           一級宏觀錯誤碼 二級宏觀錯誤碼
二級宏觀錯誤碼
二級宏觀錯誤碼
                                                一級宏觀錯誤碼 二級宏觀錯誤碼
               介面不存在
   消息服務出錯
   消息投遞出錯
   消息消費出錯
   消息訂閱出錯
   C0124 消息分組未查到
    49/50

C0130
C0131
C0132
C0133
C0134
C0140
C0150
C0151
C0152
C0153
C0154
C0200
C0210
C0220
C0230
C0240
C0250
C0300
C0311
C0312
C0321
C0331
C0341
C0400
C0401
C0402
C0500
C0501
C0502
緩存服務出錯
key 長度超過限制
value 長度超過限制
存儲容量已滿
不支援的資料格式
配置服務出錯
網路資源服務出錯
VPN 服務出錯
CDN 服務出錯
功能變數名稱解析服務出錯
閘道服務出錯
協力廠商系統執行超時
RPC 執行超時
消息投遞超時
緩存服務超時
配置服務超時
資料庫服務超時
資料庫服務出錯
表不存在
列不存在
多表關聯中存在多個相同名稱的列
資料庫鎖死
主鍵衝突
協力廠商容災系統被觸發
協力廠商系統限流
Java 開發手冊
                                     二級宏觀錯誤碼
二級宏觀錯誤碼
二級宏觀錯誤碼
二級宏觀錯誤碼
                                          協力廠商功能降級
   通知服務出錯
   短信提醒服務失敗
   語音提醒服務失敗
   C0503 郵件提醒服務失敗
    50/50

 